/* automatically generated by rust-bindgen 0.59.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 35;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const IOTEX_VC_BUILD_PROPERTY_TYPE_MAX: u32 = 234881024;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PRIVATE_STRING: u32 = 1;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PRIVATE_NUM: u32 = 2;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PRIVATE_BOOL: u32 = 4;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PRIVATE_JSON: u32 = 8;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_ID: u32 = 16;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_TYPE: u32 = 32;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PRIVATE_MASK: u32 = 15;
pub const IOTEX_VC_BUILD_PROPERTY_MAIN_TYPE_MASK: u32 = 4278190080;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_MASK: u32 = 16777215;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PROOF_VALID_MASK: u32 = 15;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_CS_VALID_MASK: u32 = 31;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_ISSUER_VALID_MASK: u32 = 31;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_EVIDENCE_VALID_MASK: u32 = 31;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_STATUS_VALID_MASK: u32 = 63;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_TERMOFUSE_VALID_MASK: u32 = 63;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_SCHEMA_VALID_MASK: u32 = 63;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_RS_VALID_MASK: u32 = 63;
pub const IOTEX_VC_BUILD_PROPERTY_SUB_TYPE_PROPERTY_VALID_MASK: u32 = 15;
pub const IOTEX_VC_PROOF_PROPERTY_CONTEXT_NAME: &'static [u8; 9usize] = b"@context\0";
pub const IOTEX_VC_PROOF_PROPERTY_PURPOSE_NAME: &'static [u8; 13usize] = b"proofPurpose\0";
pub const IOTEX_VC_PROOF_PROPERTY_VALUE_NAME: &'static [u8; 11usize] = b"proofValue\0";
pub const IOTEX_VC_PROOF_PROPERTY_CHALLENGE_NAME: &'static [u8; 10usize] = b"challenge\0";
pub const IOTEX_VC_PROOF_PROPERTY_VERIFICATION_METHOD_NAME: &'static [u8; 19usize] =
    b"verificationMethod\0";
pub const IOTEX_VC_PROOF_PROPERTY_CREATED_NAME: &'static [u8; 8usize] = b"created\0";
pub const IOTEX_VC_PROOF_PROPERTY_EXPIRES_NAME: &'static [u8; 8usize] = b"expires\0";
pub const IOTEX_VC_PROOF_PROPERTY_DOMAIN_NAME: &'static [u8; 7usize] = b"domain\0";
pub const IOTEX_VC_PROOF_PROPERTY_NONCE_NAME: &'static [u8; 6usize] = b"nonce\0";
pub const IOTEX_VC_PROOF_PROPERTY_CRYPTOSUITE_NAME: &'static [u8; 12usize] = b"cryptosuite\0";
pub const IOTEX_VC_PROPERTY_ID_BUFFER_SIZE: u32 = 64;
pub const IOTEX_VC_PROPERTY_EXP_DATE_BUFFER_SIZE: u32 = 64;
pub const IOTEX_VC_PROPERTY_ISSUANCE_DATE_BUFFER_SIZE: u32 = 32;
pub const DIDCOMM_SIGN_TYP: &'static [u8; 32usize] = b"application/didcomm-signed+json\0";
pub const PLAINTEXT_TYP: &'static [u8; 31usize] = b"application/didcomm-plain+json\0";
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type psa_status_t = i32;
#[doc = " \\brief Encoding of a key type."]
pub type psa_key_type_t = u16;
#[doc = " The type of PSA elliptic curve family identifiers."]
#[doc = ""]
#[doc = " The curve identifier is required to create an ECC key using the"]
#[doc = " PSA_KEY_TYPE_ECC_KEY_PAIR() or PSA_KEY_TYPE_ECC_PUBLIC_KEY()"]
#[doc = " macros."]
#[doc = ""]
#[doc = " Values defined by this standard will never be in the range 0x80-0xff."]
#[doc = " Vendors who define additional families must use an encoding in this range."]
pub type psa_ecc_family_t = u8;
#[doc = " The type of PSA Diffie-Hellman group family identifiers."]
#[doc = ""]
#[doc = " The group identifier is required to create an Diffie-Hellman key using the"]
#[doc = " PSA_KEY_TYPE_DH_KEY_PAIR() or PSA_KEY_TYPE_DH_PUBLIC_KEY()"]
#[doc = " macros."]
#[doc = ""]
#[doc = " Values defined by this standard will never be in the range 0x80-0xff."]
#[doc = " Vendors who define additional families must use an encoding in this range."]
pub type psa_dh_family_t = u8;
#[doc = " \\brief Encoding of a cryptographic algorithm."]
#[doc = ""]
#[doc = " For algorithms that can be applied to multiple key types, this type"]
#[doc = " does not encode the key type. For example, for symmetric ciphers"]
#[doc = " based on a block cipher, #psa_algorithm_t encodes the block cipher"]
#[doc = " mode and the padding mode while the block cipher itself is encoded"]
#[doc = " via #psa_key_type_t."]
pub type psa_algorithm_t = u32;
#[doc = " Encoding of key lifetimes."]
#[doc = ""]
#[doc = " The lifetime of a key indicates where it is stored and what system actions"]
#[doc = " may create and destroy it."]
#[doc = ""]
#[doc = " Lifetime values have the following structure:"]
#[doc = " - Bits 0-7 (#PSA_KEY_LIFETIME_GET_PERSISTENCE(\\c lifetime)):"]
#[doc = "   persistence level. This value indicates what device management"]
#[doc = "   actions can cause it to be destroyed. In particular, it indicates"]
#[doc = "   whether the key is _volatile_ or _persistent_."]
#[doc = "   See ::psa_key_persistence_t for more information."]
#[doc = " - Bits 8-31 (#PSA_KEY_LIFETIME_GET_LOCATION(\\c lifetime)):"]
#[doc = "   location indicator. This value indicates which part of the system"]
#[doc = "   has access to the key material and can perform operations using the key."]
#[doc = "   See ::psa_key_location_t for more information."]
#[doc = ""]
#[doc = " Volatile keys are automatically destroyed when the application instance"]
#[doc = " terminates or on a power reset of the device. Persistent keys are"]
#[doc = " preserved until the application explicitly destroys them or until an"]
#[doc = " integration-specific device management event occurs (for example,"]
#[doc = " a factory reset)."]
#[doc = ""]
#[doc = " Persistent keys have a key identifier of type #psa_key_id_t."]
#[doc = " This identifier remains valid throughout the lifetime of the key,"]
#[doc = " even if the application instance that created the key terminates."]
#[doc = " The application can call psa_open_key() to open a persistent key that"]
#[doc = " it created previously."]
#[doc = ""]
#[doc = " The default lifetime of a key is #PSA_KEY_LIFETIME_VOLATILE. The lifetime"]
#[doc = " #PSA_KEY_LIFETIME_PERSISTENT is supported if persistent storage is"]
#[doc = " available. Other lifetime values may be supported depending on the"]
#[doc = " library configuration."]
pub type psa_key_lifetime_t = u32;
#[doc = " Encoding of key persistence levels."]
#[doc = ""]
#[doc = " What distinguishes different persistence levels is what device management"]
#[doc = " events may cause keys to be destroyed. _Volatile_ keys are destroyed"]
#[doc = " by a power reset. Persistent keys may be destroyed by events such as"]
#[doc = " a transfer of ownership or a factory reset. What management events"]
#[doc = " actually affect persistent keys at different levels is outside the"]
#[doc = " scope of the PSA Cryptography specification."]
#[doc = ""]
#[doc = " The PSA Cryptography specification defines the following values of"]
#[doc = " persistence levels:"]
#[doc = " - \\c 0 = #PSA_KEY_PERSISTENCE_VOLATILE: volatile key."]
#[doc = "   A volatile key is automatically destroyed by the implementation when"]
#[doc = "   the application instance terminates. In particular, a volatile key"]
#[doc = "   is automatically destroyed on a power reset of the device."]
#[doc = " - \\c 1 = #PSA_KEY_PERSISTENCE_DEFAULT:"]
#[doc = "   persistent key with a default lifetime."]
#[doc = " - \\c 2-254: currently not supported by Mbed TLS."]
#[doc = " - \\c 255 = #PSA_KEY_PERSISTENCE_READ_ONLY:"]
#[doc = "   read-only or write-once key."]
#[doc = "   A key with this persistence level cannot be destroyed."]
#[doc = "   Mbed TLS does not currently offer a way to create such keys, but"]
#[doc = "   integrations of Mbed TLS can use it for built-in keys that the"]
#[doc = "   application cannot modify (for example, a hardware unique key (HUK))."]
#[doc = ""]
#[doc = " \\note Key persistence levels are 8-bit values. Key management"]
#[doc = "       interfaces operate on lifetimes (type ::psa_key_lifetime_t) which"]
#[doc = "       encode the persistence as the lower 8 bits of a 32-bit value."]
pub type psa_key_persistence_t = u8;
#[doc = " Encoding of key location indicators."]
#[doc = ""]
#[doc = " If an integration of Mbed TLS can make calls to external"]
#[doc = " cryptoprocessors such as secure elements, the location of a key"]
#[doc = " indicates which secure element performs the operations on the key."]
#[doc = " Depending on the design of the secure element, the key"]
#[doc = " material may be stored either in the secure element, or"]
#[doc = " in wrapped (encrypted) form alongside the key metadata in the"]
#[doc = " primary local storage."]
#[doc = ""]
#[doc = " The PSA Cryptography API specification defines the following values of"]
#[doc = " location indicators:"]
#[doc = " - \\c 0: primary local storage."]
#[doc = "   This location is always available."]
#[doc = "   The primary local storage is typically the same storage area that"]
#[doc = "   contains the key metadata."]
#[doc = " - \\c 1: primary secure element."]
#[doc = "   Integrations of Mbed TLS should support this value if there is a secure"]
#[doc = "   element attached to the operating environment."]
#[doc = "   As a guideline, secure elements may provide higher resistance against"]
#[doc = "   side channel and physical attacks than the primary local storage, but may"]
#[doc = "   have restrictions on supported key types, sizes, policies and operations"]
#[doc = "   and may have different performance characteristics."]
#[doc = " - \\c 2-0x7fffff: other locations defined by a PSA specification."]
#[doc = "   The PSA Cryptography API does not currently assign any meaning to these"]
#[doc = "   locations, but future versions of that specification or other PSA"]
#[doc = "   specifications may do so."]
#[doc = " - \\c 0x800000-0xffffff: vendor-defined locations."]
#[doc = "   No PSA specification will assign a meaning to locations in this range."]
#[doc = ""]
#[doc = " \\note Key location indicators are 24-bit values. Key management"]
#[doc = "       interfaces operate on lifetimes (type ::psa_key_lifetime_t) which"]
#[doc = "       encode the location as the upper 24 bits of a 32-bit value."]
pub type psa_key_location_t = u32;
#[doc = " Encoding of identifiers of persistent keys."]
#[doc = ""]
#[doc = " - Applications may freely choose key identifiers in the range"]
#[doc = "   #PSA_KEY_ID_USER_MIN to #PSA_KEY_ID_USER_MAX."]
#[doc = " - The implementation may define additional key identifiers in the range"]
#[doc = "   #PSA_KEY_ID_VENDOR_MIN to #PSA_KEY_ID_VENDOR_MAX."]
#[doc = " - 0 is reserved as an invalid key identifier."]
#[doc = " - Key identifiers outside these ranges are reserved for future use."]
pub type psa_key_id_t = u32;
#[doc = " \\brief Encoding of permitted usage on a key."]
pub type psa_key_usage_t = u32;
#[doc = " The type of a structure containing key attributes."]
#[doc = ""]
#[doc = " This is an opaque structure that can represent the metadata of a key"]
#[doc = " object. Metadata that can be stored in attributes includes:"]
#[doc = " - The location of the key in storage, indicated by its key identifier"]
#[doc = "   and its lifetime."]
#[doc = " - The key's policy, comprising usage flags and a specification of"]
#[doc = "   the permitted algorithm(s)."]
#[doc = " - Information about the key itself: the key type and its size."]
#[doc = " - Additional implementation-defined attributes."]
#[doc = ""]
#[doc = " The actual key material is not considered an attribute of a key."]
#[doc = " Key attributes do not contain information that is generally considered"]
#[doc = " highly confidential."]
#[doc = ""]
#[doc = " An attribute structure works like a simple data structure where each function"]
#[doc = " `psa_set_key_xxx` sets a field and the corresponding function"]
#[doc = " `psa_get_key_xxx` retrieves the value of the corresponding field."]
#[doc = " However, a future version of the library  may report values that are"]
#[doc = " equivalent to the original one, but have a different encoding. Invalid"]
#[doc = " values may be mapped to different, also invalid values."]
#[doc = ""]
#[doc = " An attribute structure may contain references to auxiliary resources,"]
#[doc = " for example pointers to allocated memory or indirect references to"]
#[doc = " pre-calculated values. In order to free such resources, the application"]
#[doc = " must call psa_reset_key_attributes(). As an exception, calling"]
#[doc = " psa_reset_key_attributes() on an attribute structure is optional if"]
#[doc = " the structure has only been modified by the following functions"]
#[doc = " since it was initialized or last reset with psa_reset_key_attributes():"]
#[doc = " - psa_set_key_id()"]
#[doc = " - psa_set_key_lifetime()"]
#[doc = " - psa_set_key_type()"]
#[doc = " - psa_set_key_bits()"]
#[doc = " - psa_set_key_usage_flags()"]
#[doc = " - psa_set_key_algorithm()"]
#[doc = ""]
#[doc = " Before calling any function on a key attribute structure, the application"]
#[doc = " must initialize it by any of the following means:"]
#[doc = " - Set the structure to all-bits-zero, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_attributes_t attributes;"]
#[doc = "   memset(&attributes, 0, sizeof(attributes));"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to logical zero values, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_attributes_t attributes = {0};"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to the initializer #PSA_KEY_ATTRIBUTES_INIT,"]
#[doc = "   for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;"]
#[doc = "   \\endcode"]
#[doc = " - Assign the result of the function psa_key_attributes_init()"]
#[doc = "   to the structure, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_attributes_t attributes;"]
#[doc = "   attributes = psa_key_attributes_init();"]
#[doc = "   \\endcode"]
#[doc = ""]
#[doc = " A freshly initialized attribute structure contains the following"]
#[doc = " values:"]
#[doc = ""]
#[doc = " - lifetime: #PSA_KEY_LIFETIME_VOLATILE."]
#[doc = " - key identifier: 0 (which is not a valid key identifier)."]
#[doc = " - type: \\c 0 (meaning that the type is unspecified)."]
#[doc = " - key size: \\c 0 (meaning that the size is unspecified)."]
#[doc = " - usage flags: \\c 0 (which allows no usage except exporting a public key)."]
#[doc = " - algorithm: \\c 0 (which allows no cryptographic usage, but allows"]
#[doc = "   exporting)."]
#[doc = ""]
#[doc = " A typical sequence to create a key is as follows:"]
#[doc = " -# Create and initialize an attribute structure."]
#[doc = " -# If the key is persistent, call psa_set_key_id()."]
#[doc = "    Also call psa_set_key_lifetime() to place the key in a non-default"]
#[doc = "    location."]
#[doc = " -# Set the key policy with psa_set_key_usage_flags() and"]
#[doc = "    psa_set_key_algorithm()."]
#[doc = " -# Set the key type with psa_set_key_type()."]
#[doc = "    Skip this step if copying an existing key with psa_copy_key()."]
#[doc = " -# When generating a random key with psa_generate_key() or deriving a key"]
#[doc = "    with psa_key_derivation_output_key(), set the desired key size with"]
#[doc = "    psa_set_key_bits()."]
#[doc = " -# Call a key creation function: psa_import_key(), psa_generate_key(),"]
#[doc = "    psa_key_derivation_output_key() or psa_copy_key(). This function reads"]
#[doc = "    the attribute structure, creates a key with these attributes, and"]
#[doc = "    outputs a key identifier to the newly created key."]
#[doc = " -# The attribute structure is now no longer necessary."]
#[doc = "    You may call psa_reset_key_attributes(), although this is optional"]
#[doc = "    with the workflow presented here because the attributes currently"]
#[doc = "    defined in this specification do not require any additional resources"]
#[doc = "    beyond the structure itself."]
#[doc = ""]
#[doc = " A typical sequence to query a key's attributes is as follows:"]
#[doc = " -# Call psa_get_key_attributes()."]
#[doc = " -# Call `psa_get_key_xxx` functions to retrieve the attribute(s) that"]
#[doc = "    you are interested in."]
#[doc = " -# Call psa_reset_key_attributes() to free any resources that may be"]
#[doc = "    used by the attribute structure."]
#[doc = ""]
#[doc = " Once a key has been created, it is impossible to change its attributes."]
pub type psa_key_attributes_t = psa_client_key_attributes_s;
#[doc = " \\brief Encoding of the step of a key derivation."]
pub type psa_key_derivation_step_t = u16;
extern "C" {
    #[doc = " \\brief Library initialization."]
    #[doc = ""]
    #[doc = " Applications must call this function before calling any other"]
    #[doc = " function in this module."]
    #[doc = ""]
    #[doc = " Applications may call this function more than once. Once a call"]
    #[doc = " succeeds, subsequent calls are guaranteed to succeed."]
    #[doc = ""]
    #[doc = " If the application calls other functions before calling psa_crypto_init(),"]
    #[doc = " the behavior is undefined. Implementations are encouraged to either perform"]
    #[doc = " the operation as if the library had been initialized or to return"]
    #[doc = " #PSA_ERROR_BAD_STATE or some other applicable error. In particular,"]
    #[doc = " implementations should not return a success status if the lack of"]
    #[doc = " initialization may have security implications, for example due to improper"]
    #[doc = " seeding of the random number generator."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_STORAGE"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    pub fn psa_crypto_init() -> psa_status_t;
}
extern "C" {
    #[doc = " Retrieve the attributes of a key."]
    #[doc = ""]
    #[doc = " This function first resets the attribute structure as with"]
    #[doc = " psa_reset_key_attributes(). It then copies the attributes of"]
    #[doc = " the given key into the given attribute structure."]
    #[doc = ""]
    #[doc = " \\note This function may allocate memory or other resources."]
    #[doc = "       Once you have called this function on an attribute structure,"]
    #[doc = "       you must call psa_reset_key_attributes() to free these resources."]
    #[doc = ""]
    #[doc = " \\param[in] key               Identifier of the key to query."]
    #[doc = " \\param[in,out] attributes    On success, the attributes of the key."]
    #[doc = "                              On failure, equivalent to a"]
    #[doc = "                              freshly-initialized structure."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_get_key_attributes(
        key: psa_key_id_t,
        attributes: *mut psa_key_attributes_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Reset a key attribute structure to a freshly initialized state."]
    #[doc = ""]
    #[doc = " You must initialize the attribute structure as described in the"]
    #[doc = " documentation of the type #psa_key_attributes_t before calling this"]
    #[doc = " function. Once the structure has been initialized, you may call this"]
    #[doc = " function at any time."]
    #[doc = ""]
    #[doc = " This function frees any auxiliary resources that the structure"]
    #[doc = " may contain."]
    #[doc = ""]
    #[doc = " \\param[in,out] attributes    The attribute structure to reset."]
    pub fn psa_reset_key_attributes(attributes: *mut psa_key_attributes_t);
}
extern "C" {
    #[doc = " Remove non-essential copies of key material from memory."]
    #[doc = ""]
    #[doc = " If the key identifier designates a volatile key, this functions does not do"]
    #[doc = " anything and returns successfully."]
    #[doc = ""]
    #[doc = " If the key identifier designates a persistent key, then this function will"]
    #[doc = " free all resources associated with the key in volatile memory. The key"]
    #[doc = " data in persistent storage is not affected and the key can still be used."]
    #[doc = ""]
    #[doc = " \\param key Identifier of the key to purge."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         The key material will have been removed from memory if it is not"]
    #[doc = "         currently required."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not a valid key identifier."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_purge_key(key: psa_key_id_t) -> psa_status_t;
}
extern "C" {
    #[doc = " Make a copy of a key."]
    #[doc = ""]
    #[doc = " Copy key material from one location to another."]
    #[doc = ""]
    #[doc = " This function is primarily useful to copy a key from one location"]
    #[doc = " to another, since it populates a key using the material from"]
    #[doc = " another key which may have a different lifetime."]
    #[doc = ""]
    #[doc = " This function may be used to share a key with a different party,"]
    #[doc = " subject to implementation-defined restrictions on key sharing."]
    #[doc = ""]
    #[doc = " The policy on the source key must have the usage flag"]
    #[doc = " #PSA_KEY_USAGE_COPY set."]
    #[doc = " This flag is sufficient to permit the copy if the key has the lifetime"]
    #[doc = " #PSA_KEY_LIFETIME_VOLATILE or #PSA_KEY_LIFETIME_PERSISTENT."]
    #[doc = " Some secure elements do not provide a way to copy a key without"]
    #[doc = " making it extractable from the secure element. If a key is located"]
    #[doc = " in such a secure element, then the key must have both usage flags"]
    #[doc = " #PSA_KEY_USAGE_COPY and #PSA_KEY_USAGE_EXPORT in order to make"]
    #[doc = " a copy of the key outside the secure element."]
    #[doc = ""]
    #[doc = " The resulting key may only be used in a way that conforms to"]
    #[doc = " both the policy of the original key and the policy specified in"]
    #[doc = " the \\p attributes parameter:"]
    #[doc = " - The usage flags on the resulting key are the bitwise-and of the"]
    #[doc = "   usage flags on the source policy and the usage flags in \\p attributes."]
    #[doc = " - If both allow the same algorithm or wildcard-based"]
    #[doc = "   algorithm policy, the resulting key has the same algorithm policy."]
    #[doc = " - If either of the policies allows an algorithm and the other policy"]
    #[doc = "   allows a wildcard-based algorithm policy that includes this algorithm,"]
    #[doc = "   the resulting key allows the same algorithm."]
    #[doc = " - If the policies do not allow any algorithm in common, this function"]
    #[doc = "   fails with the status #PSA_ERROR_INVALID_ARGUMENT."]
    #[doc = ""]
    #[doc = " The effect of this function on implementation-defined attributes is"]
    #[doc = " implementation-defined."]
    #[doc = ""]
    #[doc = " \\param source_key        The key to copy. It must allow the usage"]
    #[doc = "                          #PSA_KEY_USAGE_COPY. If a private or secret key is"]
    #[doc = "                          being copied outside of a secure element it must"]
    #[doc = "                          also allow #PSA_KEY_USAGE_EXPORT."]
    #[doc = " \\param[in] attributes    The attributes for the new key."]
    #[doc = "                          They are used as follows:"]
    #[doc = "                          - The key type and size may be 0. If either is"]
    #[doc = "                            nonzero, it must match the corresponding"]
    #[doc = "                            attribute of the source key."]
    #[doc = "                          - The key location (the lifetime and, for"]
    #[doc = "                            persistent keys, the key identifier) is"]
    #[doc = "                            used directly."]
    #[doc = "                          - The policy constraints (usage flags and"]
    #[doc = "                            algorithm policy) are combined from"]
    #[doc = "                            the source key and \\p attributes so that"]
    #[doc = "                            both sets of restrictions apply, as"]
    #[doc = "                            described in the documentation of this function."]
    #[doc = " \\param[out] target_key   On success, an identifier for the newly created"]
    #[doc = "                          key. For persistent keys, this is the key"]
    #[doc = "                          identifier defined in \\p attributes."]
    #[doc = "                          \\c 0 on failure."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = "         \\p source_key is invalid."]
    #[doc = " \\retval #PSA_ERROR_ALREADY_EXISTS"]
    #[doc = "         This is an attempt to create a persistent key, and there is"]
    #[doc = "         already a persistent key with the given identifier."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The lifetime or identifier in \\p attributes are invalid."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The policy constraints on the source and specified in"]
    #[doc = "         \\p attributes are incompatible."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p attributes specifies a key type or key size"]
    #[doc = "         which does not match the attributes of the source key."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The source key does not have the #PSA_KEY_USAGE_COPY usage flag."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The source key is not exportable and its lifetime does not"]
    #[doc = "         allow copying it to the target's lifetime."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_STORAGE"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_copy_key(
        source_key: psa_key_id_t,
        attributes: *const psa_key_attributes_t,
        target_key: *mut psa_key_id_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Destroy a key."]
    #[doc = ""]
    #[doc = " This function destroys a key from both volatile"]
    #[doc = " memory and, if applicable, non-volatile storage. Implementations shall"]
    #[doc = " make a best effort to ensure that that the key material cannot be recovered."]
    #[doc = ""]
    #[doc = " This function also erases any metadata such as policies and frees"]
    #[doc = " resources associated with the key."]
    #[doc = ""]
    #[doc = " If a key is currently in use in a multipart operation, then destroying the"]
    #[doc = " key will cause the multipart operation to fail."]
    #[doc = ""]
    #[doc = " \\param key  Identifier of the key to erase. If this is \\c 0, do nothing and"]
    #[doc = "             return #PSA_SUCCESS."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         \\p key was a valid identifier and the key material that it"]
    #[doc = "         referred to has been erased. Alternatively, \\p key is \\c 0."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The key cannot be erased because it is"]
    #[doc = "         read-only, either due to a policy or due to physical restrictions."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = "         \\p key is not a valid identifier nor \\c 0."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = "         There was an failure in communication with the cryptoprocessor."]
    #[doc = "         The key material may still be present in the cryptoprocessor."]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = "         This error is typically a result of either storage corruption on a"]
    #[doc = "         cleartext storage backend, or an attempt to read data that was"]
    #[doc = "         written by an incompatible version of the library."]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = "         The storage is corrupted. Implementations shall make a best effort"]
    #[doc = "         to erase key material even in this stage, however applications"]
    #[doc = "         should be aware that it may be impossible to guarantee that the"]
    #[doc = "         key material is not recoverable in such cases."]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = "         An unexpected condition which is not a storage corruption or"]
    #[doc = "         a communication failure occurred. The cryptoprocessor may have"]
    #[doc = "         been compromised."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_destroy_key(key: psa_key_id_t) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Import a key in binary format."]
    #[doc = ""]
    #[doc = " This function supports any output from psa_export_key(). Refer to the"]
    #[doc = " documentation of psa_export_public_key() for the format of public keys"]
    #[doc = " and to the documentation of psa_export_key() for the format for"]
    #[doc = " other key types."]
    #[doc = ""]
    #[doc = " The key data determines the key size. The attributes may optionally"]
    #[doc = " specify a key size; in this case it must match the size determined"]
    #[doc = " from the key data. A key size of 0 in \\p attributes indicates that"]
    #[doc = " the key size is solely determined by the key data."]
    #[doc = ""]
    #[doc = " Implementations must reject an attempt to import a key of size 0."]
    #[doc = ""]
    #[doc = " This specification supports a single format for each key type."]
    #[doc = " Implementations may support other formats as long as the standard"]
    #[doc = " format is supported. Implementations that support other formats"]
    #[doc = " should ensure that the formats are clearly unambiguous so as to"]
    #[doc = " minimize the risk that an invalid input is accidentally interpreted"]
    #[doc = " according to a different format."]
    #[doc = ""]
    #[doc = " \\param[in] attributes    The attributes for the new key."]
    #[doc = "                          The key size is always determined from the"]
    #[doc = "                          \\p data buffer."]
    #[doc = "                          If the key size in \\p attributes is nonzero,"]
    #[doc = "                          it must be equal to the size from \\p data."]
    #[doc = " \\param[out] key          On success, an identifier to the newly created key."]
    #[doc = "                          For persistent keys, this is the key identifier"]
    #[doc = "                          defined in \\p attributes."]
    #[doc = "                          \\c 0 on failure."]
    #[doc = " \\param[in] data    Buffer containing the key data. The content of this"]
    #[doc = "                    buffer is interpreted according to the type declared"]
    #[doc = "                    in \\p attributes."]
    #[doc = "                    All implementations must support at least the format"]
    #[doc = "                    described in the documentation"]
    #[doc = "                    of psa_export_key() or psa_export_public_key() for"]
    #[doc = "                    the chosen type. Implementations may allow other"]
    #[doc = "                    formats, but should be conservative: implementations"]
    #[doc = "                    should err on the side of rejecting content if it"]
    #[doc = "                    may be erroneous (e.g. wrong type or truncated data)."]
    #[doc = " \\param data_length Size of the \\p data buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = "         If the key is persistent, the key material and the key's metadata"]
    #[doc = "         have been saved to persistent storage."]
    #[doc = " \\retval #PSA_ERROR_ALREADY_EXISTS"]
    #[doc = "         This is an attempt to create a persistent key, and there is"]
    #[doc = "         already a persistent key with the given identifier."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         The key type or key size is not supported, either by the"]
    #[doc = "         implementation in general or in this particular persistent location."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The key attributes, as a whole, are invalid."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The key data is not correctly formatted."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The size in \\p attributes is nonzero and does not match the size"]
    #[doc = "         of the key data."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_STORAGE"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_import_key(
        attributes: *const psa_key_attributes_t,
        data: *const u8,
        data_length: size_t,
        key: *mut psa_key_id_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Export a key in binary format."]
    #[doc = ""]
    #[doc = " The output of this function can be passed to psa_import_key() to"]
    #[doc = " create an equivalent object."]
    #[doc = ""]
    #[doc = " If the implementation of psa_import_key() supports other formats"]
    #[doc = " beyond the format specified here, the output from psa_export_key()"]
    #[doc = " must use the representation specified here, not the original"]
    #[doc = " representation."]
    #[doc = ""]
    #[doc = " For standard key types, the output format is as follows:"]
    #[doc = ""]
    #[doc = " - For symmetric keys (including MAC keys), the format is the"]
    #[doc = "   raw bytes of the key."]
    #[doc = " - For DES, the key data consists of 8 bytes. The parity bits must be"]
    #[doc = "   correct."]
    #[doc = " - For Triple-DES, the format is the concatenation of the"]
    #[doc = "   two or three DES keys."]
    #[doc = " - For RSA key pairs (#PSA_KEY_TYPE_RSA_KEY_PAIR), the format"]
    #[doc = "   is the non-encrypted DER encoding of the representation defined by"]
    #[doc = "   PKCS\\#1 (RFC 8017) as `RSAPrivateKey`, version 0."]
    #[doc = "   ```"]
    #[doc = "   RSAPrivateKey ::= SEQUENCE {"]
    #[doc = "       version             INTEGER,  -- must be 0"]
    #[doc = "       modulus             INTEGER,  -- n"]
    #[doc = "       publicExponent      INTEGER,  -- e"]
    #[doc = "       privateExponent     INTEGER,  -- d"]
    #[doc = "       prime1              INTEGER,  -- p"]
    #[doc = "       prime2              INTEGER,  -- q"]
    #[doc = "       exponent1           INTEGER,  -- d mod (p-1)"]
    #[doc = "       exponent2           INTEGER,  -- d mod (q-1)"]
    #[doc = "       coefficient         INTEGER,  -- (inverse of q) mod p"]
    #[doc = "   }"]
    #[doc = "   ```"]
    #[doc = " - For elliptic curve key pairs (key types for which"]
    #[doc = "   #PSA_KEY_TYPE_IS_ECC_KEY_PAIR is true), the format is"]
    #[doc = "   a representation of the private value as a `ceiling(m/8)`-byte string"]
    #[doc = "   where `m` is the bit size associated with the curve, i.e. the bit size"]
    #[doc = "   of the order of the curve's coordinate field. This byte string is"]
    #[doc = "   in little-endian order for Montgomery curves (curve types"]
    #[doc = "   `PSA_ECC_FAMILY_CURVEXXX`), and in big-endian order for Weierstrass"]
    #[doc = "   curves (curve types `PSA_ECC_FAMILY_SECTXXX`, `PSA_ECC_FAMILY_SECPXXX`"]
    #[doc = "   and `PSA_ECC_FAMILY_BRAINPOOL_PXXX`)."]
    #[doc = "   For Weierstrass curves, this is the content of the `privateKey` field of"]
    #[doc = "   the `ECPrivateKey` format defined by RFC 5915.  For Montgomery curves,"]
    #[doc = "   the format is defined by RFC 7748, and output is masked according to 5."]
    #[doc = "   For twisted Edwards curves, the private key is as defined by RFC 8032"]
    #[doc = "   (a 32-byte string for Edwards25519, a 57-byte string for Edwards448)."]
    #[doc = " - For Diffie-Hellman key exchange key pairs (key types for which"]
    #[doc = "   #PSA_KEY_TYPE_IS_DH_KEY_PAIR is true), the"]
    #[doc = "   format is the representation of the private key `x` as a big-endian byte"]
    #[doc = "   string. The length of the byte string is the private key size in bytes"]
    #[doc = "   (leading zeroes are not stripped)."]
    #[doc = " - For public keys (key types for which #PSA_KEY_TYPE_IS_PUBLIC_KEY is"]
    #[doc = "   true), the format is the same as for psa_export_public_key()."]
    #[doc = ""]
    #[doc = " The policy on the key must have the usage flag #PSA_KEY_USAGE_EXPORT set."]
    #[doc = ""]
    #[doc = " \\param key               Identifier of the key to export. It must allow the"]
    #[doc = "                          usage #PSA_KEY_USAGE_EXPORT, unless it is a public"]
    #[doc = "                          key."]
    #[doc = " \\param[out] data         Buffer where the key data is to be written."]
    #[doc = " \\param data_size         Size of the \\p data buffer in bytes."]
    #[doc = " \\param[out] data_length  On success, the number of bytes"]
    #[doc = "                          that make up the key data."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The key does not have the #PSA_KEY_USAGE_EXPORT flag."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p data buffer is too small. You can determine a"]
    #[doc = "         sufficient buffer size by calling"]
    #[doc = "         #PSA_EXPORT_KEY_OUTPUT_SIZE(\\c type, \\c bits)"]
    #[doc = "         where \\c type is the key type"]
    #[doc = "         and \\c bits is the key size in bits."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_export_key(
        key: psa_key_id_t,
        data: *mut u8,
        data_size: size_t,
        data_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Export a public key or the public part of a key pair in binary format."]
    #[doc = ""]
    #[doc = " The output of this function can be passed to psa_import_key() to"]
    #[doc = " create an object that is equivalent to the public key."]
    #[doc = ""]
    #[doc = " This specification supports a single format for each key type."]
    #[doc = " Implementations may support other formats as long as the standard"]
    #[doc = " format is supported. Implementations that support other formats"]
    #[doc = " should ensure that the formats are clearly unambiguous so as to"]
    #[doc = " minimize the risk that an invalid input is accidentally interpreted"]
    #[doc = " according to a different format."]
    #[doc = ""]
    #[doc = " For standard key types, the output format is as follows:"]
    #[doc = " - For RSA public keys (#PSA_KEY_TYPE_RSA_PUBLIC_KEY), the DER encoding of"]
    #[doc = "   the representation defined by RFC 3279 &sect;2.3.1 as `RSAPublicKey`."]
    #[doc = "   ```"]
    #[doc = "   RSAPublicKey ::= SEQUENCE {"]
    #[doc = "      modulus            INTEGER,    -- n"]
    #[doc = "      publicExponent     INTEGER  }  -- e"]
    #[doc = "   ```"]
    #[doc = " - For elliptic curve keys on a twisted Edwards curve (key types for which"]
    #[doc = "   #PSA_KEY_TYPE_IS_ECC_PUBLIC_KEY is true and #PSA_KEY_TYPE_ECC_GET_FAMILY"]
    #[doc = "   returns #PSA_ECC_FAMILY_TWISTED_EDWARDS), the public key is as defined"]
    #[doc = "   by RFC 8032"]
    #[doc = "   (a 32-byte string for Edwards25519, a 57-byte string for Edwards448)."]
    #[doc = " - For other elliptic curve public keys (key types for which"]
    #[doc = "   #PSA_KEY_TYPE_IS_ECC_PUBLIC_KEY is true), the format is the uncompressed"]
    #[doc = "   representation defined by SEC1 &sect;2.3.3 as the content of an ECPoint."]
    #[doc = "   Let `m` be the bit size associated with the curve, i.e. the bit size of"]
    #[doc = "   `q` for a curve over `F_q`. The representation consists of:"]
    #[doc = "      - The byte 0x04;"]
    #[doc = "      - `x_P` as a `ceiling(m/8)`-byte string, big-endian;"]
    #[doc = "      - `y_P` as a `ceiling(m/8)`-byte string, big-endian."]
    #[doc = " - For Diffie-Hellman key exchange public keys (key types for which"]
    #[doc = "   #PSA_KEY_TYPE_IS_DH_PUBLIC_KEY is true),"]
    #[doc = "   the format is the representation of the public key `y = g^x mod p` as a"]
    #[doc = "   big-endian byte string. The length of the byte string is the length of the"]
    #[doc = "   base prime `p` in bytes."]
    #[doc = ""]
    #[doc = " Exporting a public key object or the public part of a key pair is"]
    #[doc = " always permitted, regardless of the key's usage flags."]
    #[doc = ""]
    #[doc = " \\param key               Identifier of the key to export."]
    #[doc = " \\param[out] data         Buffer where the key data is to be written."]
    #[doc = " \\param data_size         Size of the \\p data buffer in bytes."]
    #[doc = " \\param[out] data_length  On success, the number of bytes"]
    #[doc = "                          that make up the key data."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The key is neither a public key nor a key pair."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p data buffer is too small. You can determine a"]
    #[doc = "         sufficient buffer size by calling"]
    #[doc = "         #PSA_EXPORT_KEY_OUTPUT_SIZE(#PSA_KEY_TYPE_PUBLIC_KEY_OF_KEY_PAIR(\\c type), \\c bits)"]
    #[doc = "         where \\c type is the key type"]
    #[doc = "         and \\c bits is the key size in bits."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_export_public_key(
        key: psa_key_id_t,
        data: *mut u8,
        data_size: size_t,
        data_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Calculate the hash (digest) of a message."]
    #[doc = ""]
    #[doc = " \\note To verify the hash of a message against an"]
    #[doc = "       expected value, use psa_hash_compare() instead."]
    #[doc = ""]
    #[doc = " \\param alg               The hash algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_HASH(\\p alg) is true)."]
    #[doc = " \\param[in] input         Buffer containing the message to hash."]
    #[doc = " \\param input_length      Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] hash         Buffer where the hash is to be written."]
    #[doc = " \\param hash_size         Size of the \\p hash buffer in bytes."]
    #[doc = " \\param[out] hash_length  On success, the number of bytes"]
    #[doc = "                          that make up the hash value. This is always"]
    #[doc = "                          #PSA_HASH_LENGTH(\\p alg)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a hash algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         \\p hash_size is too small"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_compute(
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        hash: *mut u8,
        hash_size: size_t,
        hash_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Calculate the hash (digest) of a message and compare it with a"]
    #[doc = " reference value."]
    #[doc = ""]
    #[doc = " \\param alg               The hash algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_HASH(\\p alg) is true)."]
    #[doc = " \\param[in] input         Buffer containing the message to hash."]
    #[doc = " \\param input_length      Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] hash         Buffer containing the expected hash value."]
    #[doc = " \\param hash_length       Size of the \\p hash buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         The expected hash is identical to the actual hash of the input."]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The hash of the message was calculated successfully, but it"]
    #[doc = "         differs from the expected hash."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a hash algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p input_length or \\p hash_length do not match the hash size for \\p alg"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_compare(
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        hash: *const u8,
        hash_length: size_t,
    ) -> psa_status_t;
}
#[doc = " The type of the state data structure for multipart hash operations."]
#[doc = ""]
#[doc = " Before calling any function on a hash operation object, the application must"]
#[doc = " initialize it by any of the following means:"]
#[doc = " - Set the structure to all-bits-zero, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_hash_operation_t operation;"]
#[doc = "   memset(&operation, 0, sizeof(operation));"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to logical zero values, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_hash_operation_t operation = {0};"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to the initializer #PSA_HASH_OPERATION_INIT,"]
#[doc = "   for example:"]
#[doc = "   \\code"]
#[doc = "   psa_hash_operation_t operation = PSA_HASH_OPERATION_INIT;"]
#[doc = "   \\endcode"]
#[doc = " - Assign the result of the function psa_hash_operation_init()"]
#[doc = "   to the structure, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_hash_operation_t operation;"]
#[doc = "   operation = psa_hash_operation_init();"]
#[doc = "   \\endcode"]
#[doc = ""]
#[doc = " This is an implementation-defined \\c struct. Applications should not"]
#[doc = " make any assumptions about the content of this structure."]
#[doc = " Implementation details can change in future versions without notice."]
pub type psa_hash_operation_t = psa_hash_operation_s;
extern "C" {
    #[doc = " Set up a multipart hash operation."]
    #[doc = ""]
    #[doc = " The sequence of operations to calculate a hash (message digest)"]
    #[doc = " is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_hash_operation_t, e.g. #PSA_HASH_OPERATION_INIT."]
    #[doc = " -# Call psa_hash_setup() to specify the algorithm."]
    #[doc = " -# Call psa_hash_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the message each time. The hash that is calculated is the hash"]
    #[doc = "    of the concatenation of these messages in order."]
    #[doc = " -# To calculate the hash, call psa_hash_finish()."]
    #[doc = "    To compare the hash with an expected value, call psa_hash_verify()."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_hash_setup(), the"]
    #[doc = " operation will need to be reset by a call to psa_hash_abort(). The"]
    #[doc = " application may call psa_hash_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_hash_setup(), the application must"]
    #[doc = " eventually terminate the operation. The following events terminate an"]
    #[doc = " operation:"]
    #[doc = " - A successful call to psa_hash_finish() or psa_hash_verify()."]
    #[doc = " - A call to psa_hash_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The operation object to set up. It must have"]
    #[doc = "                          been initialized as per the documentation for"]
    #[doc = "                          #psa_hash_operation_t and not yet in use."]
    #[doc = " \\param alg               The hash algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_HASH(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not a supported hash algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p alg is not a hash algorithm."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_setup(
        operation: *mut psa_hash_operation_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Add a message fragment to a multipart hash operation."]
    #[doc = ""]
    #[doc = " The application must call psa_hash_setup() before calling this function."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_hash_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation Active hash operation."]
    #[doc = " \\param[in] input         Buffer containing the message fragment to hash."]
    #[doc = " \\param input_length      Size of the \\p input buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it muct be active)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_update(
        operation: *mut psa_hash_operation_t,
        input: *const u8,
        input_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish the calculation of the hash of a message."]
    #[doc = ""]
    #[doc = " The application must call psa_hash_setup() before calling this function."]
    #[doc = " This function calculates the hash of the message formed by concatenating"]
    #[doc = " the inputs passed to preceding calls to psa_hash_update()."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_hash_abort()."]
    #[doc = ""]
    #[doc = " \\warning Applications should not call this function if they expect"]
    #[doc = "          a specific value for the hash. Call psa_hash_verify() instead."]
    #[doc = "          Beware that comparing integrity or authenticity data such as"]
    #[doc = "          hash values with a function such as \\c memcmp is risky"]
    #[doc = "          because the time taken by the comparison may leak information"]
    #[doc = "          about the hashed data which could allow an attacker to guess"]
    #[doc = "          a valid hash and thereby bypass security controls."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active hash operation."]
    #[doc = " \\param[out] hash             Buffer where the hash is to be written."]
    #[doc = " \\param hash_size             Size of the \\p hash buffer in bytes."]
    #[doc = " \\param[out] hash_length      On success, the number of bytes"]
    #[doc = "                              that make up the hash value. This is always"]
    #[doc = "                              #PSA_HASH_LENGTH(\\c alg) where \\c alg is the"]
    #[doc = "                              hash algorithm that is calculated."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p hash buffer is too small. You can determine a"]
    #[doc = "         sufficient buffer size by calling #PSA_HASH_LENGTH(\\c alg)"]
    #[doc = "         where \\c alg is the hash algorithm that is calculated."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_finish(
        operation: *mut psa_hash_operation_t,
        hash: *mut u8,
        hash_size: size_t,
        hash_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish the calculation of the hash of a message and compare it with"]
    #[doc = " an expected value."]
    #[doc = ""]
    #[doc = " The application must call psa_hash_setup() before calling this function."]
    #[doc = " This function calculates the hash of the message formed by concatenating"]
    #[doc = " the inputs passed to preceding calls to psa_hash_update(). It then"]
    #[doc = " compares the calculated hash with the expected hash passed as a"]
    #[doc = " parameter to this function."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_hash_abort()."]
    #[doc = ""]
    #[doc = " \\note Implementations shall make the best effort to ensure that the"]
    #[doc = " comparison between the actual hash and the expected hash is performed"]
    #[doc = " in constant time."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active hash operation."]
    #[doc = " \\param[in] hash              Buffer containing the expected hash value."]
    #[doc = " \\param hash_length           Size of the \\p hash buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         The expected hash is identical to the actual hash of the message."]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The hash of the message was calculated successfully, but it"]
    #[doc = "         differs from the expected hash."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_verify(
        operation: *mut psa_hash_operation_t,
        hash: *const u8,
        hash_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Abort a hash operation."]
    #[doc = ""]
    #[doc = " Aborting an operation frees all associated resources except for the"]
    #[doc = " \\p operation structure itself. Once aborted, the operation object"]
    #[doc = " can be reused for another operation by calling"]
    #[doc = " psa_hash_setup() again."]
    #[doc = ""]
    #[doc = " You may call this function any time after the operation object has"]
    #[doc = " been initialized by one of the methods described in #psa_hash_operation_t."]
    #[doc = ""]
    #[doc = " In particular, calling psa_hash_abort() after the operation has been"]
    #[doc = " terminated by a call to psa_hash_abort(), psa_hash_finish() or"]
    #[doc = " psa_hash_verify() is safe and has no effect."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Initialized hash operation."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_abort(operation: *mut psa_hash_operation_t) -> psa_status_t;
}
extern "C" {
    #[doc = " Clone a hash operation."]
    #[doc = ""]
    #[doc = " This function copies the state of an ongoing hash operation to"]
    #[doc = " a new operation object. In other words, this function is equivalent"]
    #[doc = " to calling psa_hash_setup() on \\p target_operation with the same"]
    #[doc = " algorithm that \\p source_operation was set up for, then"]
    #[doc = " psa_hash_update() on \\p target_operation with the same input that"]
    #[doc = " that was passed to \\p source_operation. After this function returns, the"]
    #[doc = " two objects are independent, i.e. subsequent calls involving one of"]
    #[doc = " the objects do not affect the other object."]
    #[doc = ""]
    #[doc = " \\param[in] source_operation      The active hash operation to clone."]
    #[doc = " \\param[in,out] target_operation  The operation object to set up."]
    #[doc = "                                  It must be initialized but not active."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The \\p source_operation state is not valid (it must be active)."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The \\p target_operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_hash_clone(
        source_operation: *const psa_hash_operation_t,
        target_operation: *mut psa_hash_operation_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Calculate the MAC (message authentication code) of a message."]
    #[doc = ""]
    #[doc = " \\note To verify the MAC of a message against an"]
    #[doc = "       expected value, use psa_mac_verify() instead."]
    #[doc = "       Beware that comparing integrity or authenticity data such as"]
    #[doc = "       MAC values with a function such as \\c memcmp is risky"]
    #[doc = "       because the time taken by the comparison may leak information"]
    #[doc = "       about the MAC value which could allow an attacker to guess"]
    #[doc = "       a valid MAC and thereby bypass security controls."]
    #[doc = ""]
    #[doc = " \\param key               Identifier of the key to use for the operation. It"]
    #[doc = "                          must allow the usage PSA_KEY_USAGE_SIGN_MESSAGE."]
    #[doc = " \\param alg               The MAC algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_MAC(\\p alg) is true)."]
    #[doc = " \\param[in] input         Buffer containing the input message."]
    #[doc = " \\param input_length      Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] mac          Buffer where the MAC value is to be written."]
    #[doc = " \\param mac_size          Size of the \\p mac buffer in bytes."]
    #[doc = " \\param[out] mac_length   On success, the number of bytes"]
    #[doc = "                          that make up the MAC value."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a MAC algorithm."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         \\p mac_size is too small"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = "         The key could not be retrieved from storage."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_compute(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        mac: *mut u8,
        mac_size: size_t,
        mac_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Calculate the MAC of a message and compare it with a reference value."]
    #[doc = ""]
    #[doc = " \\param key               Identifier of the key to use for the operation. It"]
    #[doc = "                          must allow the usage PSA_KEY_USAGE_VERIFY_MESSAGE."]
    #[doc = " \\param alg               The MAC algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_MAC(\\p alg) is true)."]
    #[doc = " \\param[in] input         Buffer containing the input message."]
    #[doc = " \\param input_length      Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] mac          Buffer containing the expected MAC value."]
    #[doc = " \\param mac_length        Size of the \\p mac buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         The expected MAC is identical to the actual MAC of the input."]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The MAC of the message was calculated successfully, but it"]
    #[doc = "         differs from the expected value."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a MAC algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = "         The key could not be retrieved from storage."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_verify(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        mac: *const u8,
        mac_length: size_t,
    ) -> psa_status_t;
}
#[doc = " The type of the state data structure for multipart MAC operations."]
#[doc = ""]
#[doc = " Before calling any function on a MAC operation object, the application must"]
#[doc = " initialize it by any of the following means:"]
#[doc = " - Set the structure to all-bits-zero, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_mac_operation_t operation;"]
#[doc = "   memset(&operation, 0, sizeof(operation));"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to logical zero values, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_mac_operation_t operation = {0};"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to the initializer #PSA_MAC_OPERATION_INIT,"]
#[doc = "   for example:"]
#[doc = "   \\code"]
#[doc = "   psa_mac_operation_t operation = PSA_MAC_OPERATION_INIT;"]
#[doc = "   \\endcode"]
#[doc = " - Assign the result of the function psa_mac_operation_init()"]
#[doc = "   to the structure, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_mac_operation_t operation;"]
#[doc = "   operation = psa_mac_operation_init();"]
#[doc = "   \\endcode"]
#[doc = ""]
#[doc = ""]
#[doc = " This is an implementation-defined \\c struct. Applications should not"]
#[doc = " make any assumptions about the content of this structure."]
#[doc = " Implementation details can change in future versions without notice."]
pub type psa_mac_operation_t = psa_mac_operation_s;
extern "C" {
    #[doc = " Set up a multipart MAC calculation operation."]
    #[doc = ""]
    #[doc = " This function sets up the calculation of the MAC"]
    #[doc = " (message authentication code) of a byte string."]
    #[doc = " To verify the MAC of a message against an"]
    #[doc = " expected value, use psa_mac_verify_setup() instead."]
    #[doc = ""]
    #[doc = " The sequence of operations to calculate a MAC is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_mac_operation_t, e.g. #PSA_MAC_OPERATION_INIT."]
    #[doc = " -# Call psa_mac_sign_setup() to specify the algorithm and key."]
    #[doc = " -# Call psa_mac_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the message each time. The MAC that is calculated is the MAC"]
    #[doc = "    of the concatenation of these messages in order."]
    #[doc = " -# At the end of the message, call psa_mac_sign_finish() to finish"]
    #[doc = "    calculating the MAC value and retrieve it."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_mac_sign_setup(), the"]
    #[doc = " operation will need to be reset by a call to psa_mac_abort(). The"]
    #[doc = " application may call psa_mac_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_mac_sign_setup(), the application must"]
    #[doc = " eventually terminate the operation through one of the following methods:"]
    #[doc = " - A successful call to psa_mac_sign_finish()."]
    #[doc = " - A call to psa_mac_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The operation object to set up. It must have"]
    #[doc = "                          been initialized as per the documentation for"]
    #[doc = "                          #psa_mac_operation_t and not yet in use."]
    #[doc = " \\param key               Identifier of the key to use for the operation. It"]
    #[doc = "                          must remain valid until the operation terminates."]
    #[doc = "                          It must allow the usage PSA_KEY_USAGE_SIGN_MESSAGE."]
    #[doc = " \\param alg               The MAC algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_MAC(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a MAC algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = "         The key could not be retrieved from storage."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_sign_setup(
        operation: *mut psa_mac_operation_t,
        key: psa_key_id_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Set up a multipart MAC verification operation."]
    #[doc = ""]
    #[doc = " This function sets up the verification of the MAC"]
    #[doc = " (message authentication code) of a byte string against an expected value."]
    #[doc = ""]
    #[doc = " The sequence of operations to verify a MAC is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_mac_operation_t, e.g. #PSA_MAC_OPERATION_INIT."]
    #[doc = " -# Call psa_mac_verify_setup() to specify the algorithm and key."]
    #[doc = " -# Call psa_mac_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the message each time. The MAC that is calculated is the MAC"]
    #[doc = "    of the concatenation of these messages in order."]
    #[doc = " -# At the end of the message, call psa_mac_verify_finish() to finish"]
    #[doc = "    calculating the actual MAC of the message and verify it against"]
    #[doc = "    the expected value."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_mac_verify_setup(), the"]
    #[doc = " operation will need to be reset by a call to psa_mac_abort(). The"]
    #[doc = " application may call psa_mac_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_mac_verify_setup(), the application must"]
    #[doc = " eventually terminate the operation through one of the following methods:"]
    #[doc = " - A successful call to psa_mac_verify_finish()."]
    #[doc = " - A call to psa_mac_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The operation object to set up. It must have"]
    #[doc = "                          been initialized as per the documentation for"]
    #[doc = "                          #psa_mac_operation_t and not yet in use."]
    #[doc = " \\param key               Identifier of the key to use for the operation. It"]
    #[doc = "                          must remain valid until the operation terminates."]
    #[doc = "                          It must allow the usage"]
    #[doc = "                          PSA_KEY_USAGE_VERIFY_MESSAGE."]
    #[doc = " \\param alg               The MAC algorithm to compute (\\c PSA_ALG_XXX value"]
    #[doc = "                          such that #PSA_ALG_IS_MAC(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c key is not compatible with \\c alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\c alg is not supported or is not a MAC algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = "         The key could not be retrieved from storage"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_verify_setup(
        operation: *mut psa_mac_operation_t,
        key: psa_key_id_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Add a message fragment to a multipart MAC operation."]
    #[doc = ""]
    #[doc = " The application must call psa_mac_sign_setup() or psa_mac_verify_setup()"]
    #[doc = " before calling this function."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_mac_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation Active MAC operation."]
    #[doc = " \\param[in] input         Buffer containing the message fragment to add to"]
    #[doc = "                          the MAC calculation."]
    #[doc = " \\param input_length      Size of the \\p input buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_update(
        operation: *mut psa_mac_operation_t,
        input: *const u8,
        input_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish the calculation of the MAC of a message."]
    #[doc = ""]
    #[doc = " The application must call psa_mac_sign_setup() before calling this function."]
    #[doc = " This function calculates the MAC of the message formed by concatenating"]
    #[doc = " the inputs passed to preceding calls to psa_mac_update()."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_mac_abort()."]
    #[doc = ""]
    #[doc = " \\warning Applications should not call this function if they expect"]
    #[doc = "          a specific value for the MAC. Call psa_mac_verify_finish() instead."]
    #[doc = "          Beware that comparing integrity or authenticity data such as"]
    #[doc = "          MAC values with a function such as \\c memcmp is risky"]
    #[doc = "          because the time taken by the comparison may leak information"]
    #[doc = "          about the MAC value which could allow an attacker to guess"]
    #[doc = "          a valid MAC and thereby bypass security controls."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation Active MAC operation."]
    #[doc = " \\param[out] mac          Buffer where the MAC value is to be written."]
    #[doc = " \\param mac_size          Size of the \\p mac buffer in bytes."]
    #[doc = " \\param[out] mac_length   On success, the number of bytes"]
    #[doc = "                          that make up the MAC value. This is always"]
    #[doc = "                          #PSA_MAC_LENGTH(\\c key_type, \\c key_bits, \\c alg)"]
    #[doc = "                          where \\c key_type and \\c key_bits are the type and"]
    #[doc = "                          bit-size respectively of the key and \\c alg is the"]
    #[doc = "                          MAC algorithm that is calculated."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be an active mac sign"]
    #[doc = "         operation)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p mac buffer is too small. You can determine a"]
    #[doc = "         sufficient buffer size by calling PSA_MAC_LENGTH()."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_sign_finish(
        operation: *mut psa_mac_operation_t,
        mac: *mut u8,
        mac_size: size_t,
        mac_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish the calculation of the MAC of a message and compare it with"]
    #[doc = " an expected value."]
    #[doc = ""]
    #[doc = " The application must call psa_mac_verify_setup() before calling this function."]
    #[doc = " This function calculates the MAC of the message formed by concatenating"]
    #[doc = " the inputs passed to preceding calls to psa_mac_update(). It then"]
    #[doc = " compares the calculated MAC with the expected MAC passed as a"]
    #[doc = " parameter to this function."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_mac_abort()."]
    #[doc = ""]
    #[doc = " \\note Implementations shall make the best effort to ensure that the"]
    #[doc = " comparison between the actual MAC and the expected MAC is performed"]
    #[doc = " in constant time."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation Active MAC operation."]
    #[doc = " \\param[in] mac           Buffer containing the expected MAC value."]
    #[doc = " \\param mac_length        Size of the \\p mac buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         The expected MAC is identical to the actual MAC of the message."]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The MAC of the message was calculated successfully, but it"]
    #[doc = "         differs from the expected MAC."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be an active mac verify"]
    #[doc = "         operation)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_verify_finish(
        operation: *mut psa_mac_operation_t,
        mac: *const u8,
        mac_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Abort a MAC operation."]
    #[doc = ""]
    #[doc = " Aborting an operation frees all associated resources except for the"]
    #[doc = " \\p operation structure itself. Once aborted, the operation object"]
    #[doc = " can be reused for another operation by calling"]
    #[doc = " psa_mac_sign_setup() or psa_mac_verify_setup() again."]
    #[doc = ""]
    #[doc = " You may call this function any time after the operation object has"]
    #[doc = " been initialized by one of the methods described in #psa_mac_operation_t."]
    #[doc = ""]
    #[doc = " In particular, calling psa_mac_abort() after the operation has been"]
    #[doc = " terminated by a call to psa_mac_abort(), psa_mac_sign_finish() or"]
    #[doc = " psa_mac_verify_finish() is safe and has no effect."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation Initialized MAC operation."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_mac_abort(operation: *mut psa_mac_operation_t) -> psa_status_t;
}
extern "C" {
    #[doc = " Encrypt a message using a symmetric cipher."]
    #[doc = ""]
    #[doc = " This function encrypts a message with a random IV (initialization"]
    #[doc = " vector). Use the multipart operation interface with a"]
    #[doc = " #psa_cipher_operation_t object to provide other forms of IV."]
    #[doc = ""]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must allow the usage #PSA_KEY_USAGE_ENCRYPT."]
    #[doc = " \\param alg                   The cipher algorithm to compute"]
    #[doc = "                              (\\c PSA_ALG_XXX value such that"]
    #[doc = "                              #PSA_ALG_IS_CIPHER(\\p alg) is true)."]
    #[doc = " \\param[in] input             Buffer containing the message to encrypt."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] output           Buffer where the output is to be written."]
    #[doc = "                              The output contains the IV followed by"]
    #[doc = "                              the ciphertext proper."]
    #[doc = " \\param output_size           Size of the \\p output buffer in bytes."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a cipher algorithm."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_encrypt(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Decrypt a message using a symmetric cipher."]
    #[doc = ""]
    #[doc = " This function decrypts a message encrypted with a symmetric cipher."]
    #[doc = ""]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must remain valid until the operation"]
    #[doc = "                              terminates. It must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_DECRYPT."]
    #[doc = " \\param alg                   The cipher algorithm to compute"]
    #[doc = "                              (\\c PSA_ALG_XXX value such that"]
    #[doc = "                              #PSA_ALG_IS_CIPHER(\\p alg) is true)."]
    #[doc = " \\param[in] input             Buffer containing the message to decrypt."]
    #[doc = "                              This consists of the IV followed by the"]
    #[doc = "                              ciphertext proper."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] output           Buffer where the plaintext is to be written."]
    #[doc = " \\param output_size           Size of the \\p output buffer in bytes."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a cipher algorithm."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_decrypt(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
#[doc = " The type of the state data structure for multipart cipher operations."]
#[doc = ""]
#[doc = " Before calling any function on a cipher operation object, the application"]
#[doc = " must initialize it by any of the following means:"]
#[doc = " - Set the structure to all-bits-zero, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_cipher_operation_t operation;"]
#[doc = "   memset(&operation, 0, sizeof(operation));"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to logical zero values, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_cipher_operation_t operation = {0};"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to the initializer #PSA_CIPHER_OPERATION_INIT,"]
#[doc = "   for example:"]
#[doc = "   \\code"]
#[doc = "   psa_cipher_operation_t operation = PSA_CIPHER_OPERATION_INIT;"]
#[doc = "   \\endcode"]
#[doc = " - Assign the result of the function psa_cipher_operation_init()"]
#[doc = "   to the structure, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_cipher_operation_t operation;"]
#[doc = "   operation = psa_cipher_operation_init();"]
#[doc = "   \\endcode"]
#[doc = ""]
#[doc = " This is an implementation-defined \\c struct. Applications should not"]
#[doc = " make any assumptions about the content of this structure."]
#[doc = " Implementation details can change in future versions without notice."]
pub type psa_cipher_operation_t = psa_cipher_operation_s;
extern "C" {
    #[doc = " Set the key for a multipart symmetric encryption operation."]
    #[doc = ""]
    #[doc = " The sequence of operations to encrypt a message with a symmetric cipher"]
    #[doc = " is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_cipher_operation_t, e.g."]
    #[doc = "    #PSA_CIPHER_OPERATION_INIT."]
    #[doc = " -# Call psa_cipher_encrypt_setup() to specify the algorithm and key."]
    #[doc = " -# Call either psa_cipher_generate_iv() or psa_cipher_set_iv() to"]
    #[doc = "    generate or set the IV (initialization vector). You should use"]
    #[doc = "    psa_cipher_generate_iv() unless the protocol you are implementing"]
    #[doc = "    requires a specific IV value."]
    #[doc = " -# Call psa_cipher_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the message each time."]
    #[doc = " -# Call psa_cipher_finish()."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_cipher_encrypt_setup(),"]
    #[doc = " the operation will need to be reset by a call to psa_cipher_abort(). The"]
    #[doc = " application may call psa_cipher_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_cipher_encrypt_setup(), the application must"]
    #[doc = " eventually terminate the operation. The following events terminate an"]
    #[doc = " operation:"]
    #[doc = " - A successful call to psa_cipher_finish()."]
    #[doc = " - A call to psa_cipher_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     The operation object to set up. It must have"]
    #[doc = "                              been initialized as per the documentation for"]
    #[doc = "                              #psa_cipher_operation_t and not yet in use."]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must remain valid until the operation"]
    #[doc = "                              terminates. It must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_ENCRYPT."]
    #[doc = " \\param alg                   The cipher algorithm to compute"]
    #[doc = "                              (\\c PSA_ALG_XXX value such that"]
    #[doc = "                              #PSA_ALG_IS_CIPHER(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a cipher algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_encrypt_setup(
        operation: *mut psa_cipher_operation_t,
        key: psa_key_id_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Set the key for a multipart symmetric decryption operation."]
    #[doc = ""]
    #[doc = " The sequence of operations to decrypt a message with a symmetric cipher"]
    #[doc = " is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_cipher_operation_t, e.g."]
    #[doc = "    #PSA_CIPHER_OPERATION_INIT."]
    #[doc = " -# Call psa_cipher_decrypt_setup() to specify the algorithm and key."]
    #[doc = " -# Call psa_cipher_set_iv() with the IV (initialization vector) for the"]
    #[doc = "    decryption. If the IV is prepended to the ciphertext, you can call"]
    #[doc = "    psa_cipher_update() on a buffer containing the IV followed by the"]
    #[doc = "    beginning of the message."]
    #[doc = " -# Call psa_cipher_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the message each time."]
    #[doc = " -# Call psa_cipher_finish()."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_cipher_decrypt_setup(),"]
    #[doc = " the operation will need to be reset by a call to psa_cipher_abort(). The"]
    #[doc = " application may call psa_cipher_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_cipher_decrypt_setup(), the application must"]
    #[doc = " eventually terminate the operation. The following events terminate an"]
    #[doc = " operation:"]
    #[doc = " - A successful call to psa_cipher_finish()."]
    #[doc = " - A call to psa_cipher_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     The operation object to set up. It must have"]
    #[doc = "                              been initialized as per the documentation for"]
    #[doc = "                              #psa_cipher_operation_t and not yet in use."]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must remain valid until the operation"]
    #[doc = "                              terminates. It must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_DECRYPT."]
    #[doc = " \\param alg                   The cipher algorithm to compute"]
    #[doc = "                              (\\c PSA_ALG_XXX value such that"]
    #[doc = "                              #PSA_ALG_IS_CIPHER(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not a cipher algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_decrypt_setup(
        operation: *mut psa_cipher_operation_t,
        key: psa_key_id_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Generate an IV for a symmetric encryption operation."]
    #[doc = ""]
    #[doc = " This function generates a random IV (initialization vector), nonce"]
    #[doc = " or initial counter value for the encryption operation as appropriate"]
    #[doc = " for the chosen algorithm, key type and key size."]
    #[doc = ""]
    #[doc = " The application must call psa_cipher_encrypt_setup() before"]
    #[doc = " calling this function."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_cipher_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active cipher operation."]
    #[doc = " \\param[out] iv               Buffer where the generated IV is to be written."]
    #[doc = " \\param iv_size               Size of the \\p iv buffer in bytes."]
    #[doc = " \\param[out] iv_length        On success, the number of bytes of the"]
    #[doc = "                              generated IV."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, with no IV set)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p iv buffer is too small."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_generate_iv(
        operation: *mut psa_cipher_operation_t,
        iv: *mut u8,
        iv_size: size_t,
        iv_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Set the IV for a symmetric encryption or decryption operation."]
    #[doc = ""]
    #[doc = " This function sets the IV (initialization vector), nonce"]
    #[doc = " or initial counter value for the encryption or decryption operation."]
    #[doc = ""]
    #[doc = " The application must call psa_cipher_encrypt_setup() before"]
    #[doc = " calling this function."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_cipher_abort()."]
    #[doc = ""]
    #[doc = " \\note When encrypting, applications should use psa_cipher_generate_iv()"]
    #[doc = " instead of this function, unless implementing a protocol that requires"]
    #[doc = " a non-random IV."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active cipher operation."]
    #[doc = " \\param[in] iv                Buffer containing the IV to use."]
    #[doc = " \\param iv_length             Size of the IV in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be an active cipher"]
    #[doc = "         encrypt operation, with no IV set)."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The size of \\p iv is not acceptable for the chosen algorithm,"]
    #[doc = "         or the chosen algorithm does not use an IV."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_set_iv(
        operation: *mut psa_cipher_operation_t,
        iv: *const u8,
        iv_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Encrypt or decrypt a message fragment in an active cipher operation."]
    #[doc = ""]
    #[doc = " Before calling this function, you must:"]
    #[doc = " 1. Call either psa_cipher_encrypt_setup() or psa_cipher_decrypt_setup()."]
    #[doc = "    The choice of setup function determines whether this function"]
    #[doc = "    encrypts or decrypts its input."]
    #[doc = " 2. If the algorithm requires an IV, call psa_cipher_generate_iv()"]
    #[doc = "    (recommended when encrypting) or psa_cipher_set_iv()."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_cipher_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active cipher operation."]
    #[doc = " \\param[in] input             Buffer containing the message fragment to"]
    #[doc = "                              encrypt or decrypt."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] output           Buffer where the output is to be written."]
    #[doc = " \\param output_size           Size of the \\p output buffer in bytes."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the returned output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, with an IV set"]
    #[doc = "         if required for the algorithm)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p output buffer is too small."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_update(
        operation: *mut psa_cipher_operation_t,
        input: *const u8,
        input_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish encrypting or decrypting a message in a cipher operation."]
    #[doc = ""]
    #[doc = " The application must call psa_cipher_encrypt_setup() or"]
    #[doc = " psa_cipher_decrypt_setup() before calling this function. The choice"]
    #[doc = " of setup function determines whether this function encrypts or"]
    #[doc = " decrypts its input."]
    #[doc = ""]
    #[doc = " This function finishes the encryption or decryption of the message"]
    #[doc = " formed by concatenating the inputs passed to preceding calls to"]
    #[doc = " psa_cipher_update()."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_cipher_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active cipher operation."]
    #[doc = " \\param[out] output           Buffer where the output is to be written."]
    #[doc = " \\param output_size           Size of the \\p output buffer in bytes."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the returned output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total input size passed to this operation is not valid for"]
    #[doc = "         this particular algorithm. For example, the algorithm is a based"]
    #[doc = "         on block cipher and requires a whole number of blocks, but the"]
    #[doc = "         total input size is not a multiple of the block size."]
    #[doc = " \\retval #PSA_ERROR_INVALID_PADDING"]
    #[doc = "         This is a decryption operation for an algorithm that includes"]
    #[doc = "         padding, and the ciphertext does not contain valid padding."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, with an IV set"]
    #[doc = "         if required for the algorithm)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p output buffer is too small."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_finish(
        operation: *mut psa_cipher_operation_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Abort a cipher operation."]
    #[doc = ""]
    #[doc = " Aborting an operation frees all associated resources except for the"]
    #[doc = " \\p operation structure itself. Once aborted, the operation object"]
    #[doc = " can be reused for another operation by calling"]
    #[doc = " psa_cipher_encrypt_setup() or psa_cipher_decrypt_setup() again."]
    #[doc = ""]
    #[doc = " You may call this function any time after the operation object has"]
    #[doc = " been initialized as described in #psa_cipher_operation_t."]
    #[doc = ""]
    #[doc = " In particular, calling psa_cipher_abort() after the operation has been"]
    #[doc = " terminated by a call to psa_cipher_abort() or psa_cipher_finish()"]
    #[doc = " is safe and has no effect."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Initialized cipher operation."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_cipher_abort(operation: *mut psa_cipher_operation_t) -> psa_status_t;
}
extern "C" {
    #[doc = " Process an authenticated encryption operation."]
    #[doc = ""]
    #[doc = " \\param key                     Identifier of the key to use for the"]
    #[doc = "                                operation. It must allow the usage"]
    #[doc = "                                #PSA_KEY_USAGE_ENCRYPT."]
    #[doc = " \\param alg                     The AEAD algorithm to compute"]
    #[doc = "                                (\\c PSA_ALG_XXX value such that"]
    #[doc = "                                #PSA_ALG_IS_AEAD(\\p alg) is true)."]
    #[doc = " \\param[in] nonce               Nonce or IV to use."]
    #[doc = " \\param nonce_length            Size of the \\p nonce buffer in bytes."]
    #[doc = " \\param[in] additional_data     Additional data that will be authenticated"]
    #[doc = "                                but not encrypted."]
    #[doc = " \\param additional_data_length  Size of \\p additional_data in bytes."]
    #[doc = " \\param[in] plaintext           Data that will be authenticated and"]
    #[doc = "                                encrypted."]
    #[doc = " \\param plaintext_length        Size of \\p plaintext in bytes."]
    #[doc = " \\param[out] ciphertext         Output buffer for the authenticated and"]
    #[doc = "                                encrypted data. The additional data is not"]
    #[doc = "                                part of this output. For algorithms where the"]
    #[doc = "                                encrypted data and the authentication tag"]
    #[doc = "                                are defined as separate outputs, the"]
    #[doc = "                                authentication tag is appended to the"]
    #[doc = "                                encrypted data."]
    #[doc = " \\param ciphertext_size         Size of the \\p ciphertext buffer in bytes."]
    #[doc = "                                This must be appropriate for the selected"]
    #[doc = "                                algorithm and key:"]
    #[doc = "                                - A sufficient output size is"]
    #[doc = "                                  #PSA_AEAD_ENCRYPT_OUTPUT_SIZE(\\c key_type,"]
    #[doc = "                                  \\p alg, \\p plaintext_length) where"]
    #[doc = "                                  \\c key_type is the type of \\p key."]
    #[doc = "                                - #PSA_AEAD_ENCRYPT_OUTPUT_MAX_SIZE(\\p"]
    #[doc = "                                  plaintext_length) evaluates to the maximum"]
    #[doc = "                                  ciphertext size of any supported AEAD"]
    #[doc = "                                  encryption."]
    #[doc = " \\param[out] ciphertext_length  On success, the size of the output"]
    #[doc = "                                in the \\p ciphertext buffer."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not an AEAD algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         \\p ciphertext_size is too small."]
    #[doc = "         #PSA_AEAD_ENCRYPT_OUTPUT_SIZE(\\c key_type, \\p alg,"]
    #[doc = "         \\p plaintext_length) or"]
    #[doc = "         #PSA_AEAD_ENCRYPT_OUTPUT_MAX_SIZE(\\p plaintext_length) can be used to"]
    #[doc = "         determine the required buffer size."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_encrypt(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        nonce: *const u8,
        nonce_length: size_t,
        additional_data: *const u8,
        additional_data_length: size_t,
        plaintext: *const u8,
        plaintext_length: size_t,
        ciphertext: *mut u8,
        ciphertext_size: size_t,
        ciphertext_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Process an authenticated decryption operation."]
    #[doc = ""]
    #[doc = " \\param key                     Identifier of the key to use for the"]
    #[doc = "                                operation. It must allow the usage"]
    #[doc = "                                #PSA_KEY_USAGE_DECRYPT."]
    #[doc = " \\param alg                     The AEAD algorithm to compute"]
    #[doc = "                                (\\c PSA_ALG_XXX value such that"]
    #[doc = "                                #PSA_ALG_IS_AEAD(\\p alg) is true)."]
    #[doc = " \\param[in] nonce               Nonce or IV to use."]
    #[doc = " \\param nonce_length            Size of the \\p nonce buffer in bytes."]
    #[doc = " \\param[in] additional_data     Additional data that has been authenticated"]
    #[doc = "                                but not encrypted."]
    #[doc = " \\param additional_data_length  Size of \\p additional_data in bytes."]
    #[doc = " \\param[in] ciphertext          Data that has been authenticated and"]
    #[doc = "                                encrypted. For algorithms where the"]
    #[doc = "                                encrypted data and the authentication tag"]
    #[doc = "                                are defined as separate inputs, the buffer"]
    #[doc = "                                must contain the encrypted data followed"]
    #[doc = "                                by the authentication tag."]
    #[doc = " \\param ciphertext_length       Size of \\p ciphertext in bytes."]
    #[doc = " \\param[out] plaintext          Output buffer for the decrypted data."]
    #[doc = " \\param plaintext_size          Size of the \\p plaintext buffer in bytes."]
    #[doc = "                                This must be appropriate for the selected"]
    #[doc = "                                algorithm and key:"]
    #[doc = "                                - A sufficient output size is"]
    #[doc = "                                  #PSA_AEAD_DECRYPT_OUTPUT_SIZE(\\c key_type,"]
    #[doc = "                                  \\p alg, \\p ciphertext_length) where"]
    #[doc = "                                  \\c key_type is the type of \\p key."]
    #[doc = "                                - #PSA_AEAD_DECRYPT_OUTPUT_MAX_SIZE(\\p"]
    #[doc = "                                  ciphertext_length) evaluates to the maximum"]
    #[doc = "                                  plaintext size of any supported AEAD"]
    #[doc = "                                  decryption."]
    #[doc = " \\param[out] plaintext_length   On success, the size of the output"]
    #[doc = "                                in the \\p plaintext buffer."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The ciphertext is not authentic."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not an AEAD algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         \\p plaintext_size is too small."]
    #[doc = "         #PSA_AEAD_DECRYPT_OUTPUT_SIZE(\\c key_type, \\p alg,"]
    #[doc = "         \\p ciphertext_length) or"]
    #[doc = "         #PSA_AEAD_DECRYPT_OUTPUT_MAX_SIZE(\\p ciphertext_length) can be used"]
    #[doc = "         to determine the required buffer size."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_decrypt(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        nonce: *const u8,
        nonce_length: size_t,
        additional_data: *const u8,
        additional_data_length: size_t,
        ciphertext: *const u8,
        ciphertext_length: size_t,
        plaintext: *mut u8,
        plaintext_size: size_t,
        plaintext_length: *mut size_t,
    ) -> psa_status_t;
}
#[doc = " The type of the state data structure for multipart AEAD operations."]
#[doc = ""]
#[doc = " Before calling any function on an AEAD operation object, the application"]
#[doc = " must initialize it by any of the following means:"]
#[doc = " - Set the structure to all-bits-zero, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_aead_operation_t operation;"]
#[doc = "   memset(&operation, 0, sizeof(operation));"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to logical zero values, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_aead_operation_t operation = {0};"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to the initializer #PSA_AEAD_OPERATION_INIT,"]
#[doc = "   for example:"]
#[doc = "   \\code"]
#[doc = "   psa_aead_operation_t operation = PSA_AEAD_OPERATION_INIT;"]
#[doc = "   \\endcode"]
#[doc = " - Assign the result of the function psa_aead_operation_init()"]
#[doc = "   to the structure, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_aead_operation_t operation;"]
#[doc = "   operation = psa_aead_operation_init();"]
#[doc = "   \\endcode"]
#[doc = ""]
#[doc = " This is an implementation-defined \\c struct. Applications should not"]
#[doc = " make any assumptions about the content of this structure."]
#[doc = " Implementation details can change in future versions without notice."]
pub type psa_aead_operation_t = psa_aead_operation_s;
extern "C" {
    #[doc = " Set the key for a multipart authenticated encryption operation."]
    #[doc = ""]
    #[doc = " The sequence of operations to encrypt a message with authentication"]
    #[doc = " is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_aead_operation_t, e.g."]
    #[doc = "    #PSA_AEAD_OPERATION_INIT."]
    #[doc = " -# Call psa_aead_encrypt_setup() to specify the algorithm and key."]
    #[doc = " -# If needed, call psa_aead_set_lengths() to specify the length of the"]
    #[doc = "    inputs to the subsequent calls to psa_aead_update_ad() and"]
    #[doc = "    psa_aead_update(). See the documentation of psa_aead_set_lengths()"]
    #[doc = "    for details."]
    #[doc = " -# Call either psa_aead_generate_nonce() or psa_aead_set_nonce() to"]
    #[doc = "    generate or set the nonce. You should use"]
    #[doc = "    psa_aead_generate_nonce() unless the protocol you are implementing"]
    #[doc = "    requires a specific nonce value."]
    #[doc = " -# Call psa_aead_update_ad() zero, one or more times, passing a fragment"]
    #[doc = "    of the non-encrypted additional authenticated data each time."]
    #[doc = " -# Call psa_aead_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the message to encrypt each time."]
    #[doc = " -# Call psa_aead_finish()."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_aead_encrypt_setup(),"]
    #[doc = " the operation will need to be reset by a call to psa_aead_abort(). The"]
    #[doc = " application may call psa_aead_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_aead_encrypt_setup(), the application must"]
    #[doc = " eventually terminate the operation. The following events terminate an"]
    #[doc = " operation:"]
    #[doc = " - A successful call to psa_aead_finish()."]
    #[doc = " - A call to psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     The operation object to set up. It must have"]
    #[doc = "                              been initialized as per the documentation for"]
    #[doc = "                              #psa_aead_operation_t and not yet in use."]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must remain valid until the operation"]
    #[doc = "                              terminates. It must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_ENCRYPT."]
    #[doc = " \\param alg                   The AEAD algorithm to compute"]
    #[doc = "                              (\\c PSA_ALG_XXX value such that"]
    #[doc = "                              #PSA_ALG_IS_AEAD(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not an AEAD algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_encrypt_setup(
        operation: *mut psa_aead_operation_t,
        key: psa_key_id_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Set the key for a multipart authenticated decryption operation."]
    #[doc = ""]
    #[doc = " The sequence of operations to decrypt a message with authentication"]
    #[doc = " is as follows:"]
    #[doc = " -# Allocate an operation object which will be passed to all the functions"]
    #[doc = "    listed here."]
    #[doc = " -# Initialize the operation object with one of the methods described in the"]
    #[doc = "    documentation for #psa_aead_operation_t, e.g."]
    #[doc = "    #PSA_AEAD_OPERATION_INIT."]
    #[doc = " -# Call psa_aead_decrypt_setup() to specify the algorithm and key."]
    #[doc = " -# If needed, call psa_aead_set_lengths() to specify the length of the"]
    #[doc = "    inputs to the subsequent calls to psa_aead_update_ad() and"]
    #[doc = "    psa_aead_update(). See the documentation of psa_aead_set_lengths()"]
    #[doc = "    for details."]
    #[doc = " -# Call psa_aead_set_nonce() with the nonce for the decryption."]
    #[doc = " -# Call psa_aead_update_ad() zero, one or more times, passing a fragment"]
    #[doc = "    of the non-encrypted additional authenticated data each time."]
    #[doc = " -# Call psa_aead_update() zero, one or more times, passing a fragment"]
    #[doc = "    of the ciphertext to decrypt each time."]
    #[doc = " -# Call psa_aead_verify()."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_aead_decrypt_setup(),"]
    #[doc = " the operation will need to be reset by a call to psa_aead_abort(). The"]
    #[doc = " application may call psa_aead_abort() at any time after the operation"]
    #[doc = " has been initialized."]
    #[doc = ""]
    #[doc = " After a successful call to psa_aead_decrypt_setup(), the application must"]
    #[doc = " eventually terminate the operation. The following events terminate an"]
    #[doc = " operation:"]
    #[doc = " - A successful call to psa_aead_verify()."]
    #[doc = " - A call to psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     The operation object to set up. It must have"]
    #[doc = "                              been initialized as per the documentation for"]
    #[doc = "                              #psa_aead_operation_t and not yet in use."]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must remain valid until the operation"]
    #[doc = "                              terminates. It must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_DECRYPT."]
    #[doc = " \\param alg                   The AEAD algorithm to compute"]
    #[doc = "                              (\\c PSA_ALG_XXX value such that"]
    #[doc = "                              #PSA_ALG_IS_AEAD(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p key is not compatible with \\p alg."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not supported or is not an AEAD algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_decrypt_setup(
        operation: *mut psa_aead_operation_t,
        key: psa_key_id_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Generate a random nonce for an authenticated encryption operation."]
    #[doc = ""]
    #[doc = " This function generates a random nonce for the authenticated encryption"]
    #[doc = " operation with an appropriate size for the chosen algorithm, key type"]
    #[doc = " and key size."]
    #[doc = ""]
    #[doc = " The application must call psa_aead_encrypt_setup() before"]
    #[doc = " calling this function."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param[out] nonce            Buffer where the generated nonce is to be"]
    #[doc = "                              written."]
    #[doc = " \\param nonce_size            Size of the \\p nonce buffer in bytes."]
    #[doc = " \\param[out] nonce_length     On success, the number of bytes of the"]
    #[doc = "                              generated nonce."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be an active aead encrypt"]
    #[doc = "         operation, with no nonce set)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p nonce buffer is too small."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_generate_nonce(
        operation: *mut psa_aead_operation_t,
        nonce: *mut u8,
        nonce_size: size_t,
        nonce_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Set the nonce for an authenticated encryption or decryption operation."]
    #[doc = ""]
    #[doc = " This function sets the nonce for the authenticated"]
    #[doc = " encryption or decryption operation."]
    #[doc = ""]
    #[doc = " The application must call psa_aead_encrypt_setup() or"]
    #[doc = " psa_aead_decrypt_setup() before calling this function."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\note When encrypting, applications should use psa_aead_generate_nonce()"]
    #[doc = " instead of this function, unless implementing a protocol that requires"]
    #[doc = " a non-random IV."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param[in] nonce             Buffer containing the nonce to use."]
    #[doc = " \\param nonce_length          Size of the nonce in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, with no nonce"]
    #[doc = "         set)."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The size of \\p nonce is not acceptable for the chosen algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_set_nonce(
        operation: *mut psa_aead_operation_t,
        nonce: *const u8,
        nonce_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Declare the lengths of the message and additional data for AEAD."]
    #[doc = ""]
    #[doc = " The application must call this function before calling"]
    #[doc = " psa_aead_update_ad() or psa_aead_update() if the algorithm for"]
    #[doc = " the operation requires it. If the algorithm does not require it,"]
    #[doc = " calling this function is optional, but if this function is called"]
    #[doc = " then the implementation must enforce the lengths."]
    #[doc = ""]
    #[doc = " You may call this function before or after setting the nonce with"]
    #[doc = " psa_aead_set_nonce() or psa_aead_generate_nonce()."]
    #[doc = ""]
    #[doc = " - For #PSA_ALG_CCM, calling this function is required."]
    #[doc = " - For the other AEAD algorithms defined in this specification, calling"]
    #[doc = "   this function is not required."]
    #[doc = " - For vendor-defined algorithm, refer to the vendor documentation."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param ad_length             Size of the non-encrypted additional"]
    #[doc = "                              authenticated data in bytes."]
    #[doc = " \\param plaintext_length      Size of the plaintext to encrypt in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, and"]
    #[doc = "         psa_aead_update_ad() and psa_aead_update() must not have been"]
    #[doc = "         called yet)."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         At least one of the lengths is not acceptable for the chosen"]
    #[doc = "         algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_set_lengths(
        operation: *mut psa_aead_operation_t,
        ad_length: size_t,
        plaintext_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Pass additional data to an active AEAD operation."]
    #[doc = ""]
    #[doc = " Additional data is authenticated, but not encrypted."]
    #[doc = ""]
    #[doc = " You may call this function multiple times to pass successive fragments"]
    #[doc = " of the additional data. You may not call this function after passing"]
    #[doc = " data to encrypt or decrypt with psa_aead_update()."]
    #[doc = ""]
    #[doc = " Before calling this function, you must:"]
    #[doc = " 1. Call either psa_aead_encrypt_setup() or psa_aead_decrypt_setup()."]
    #[doc = " 2. Set the nonce with psa_aead_generate_nonce() or psa_aead_set_nonce()."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\warning When decrypting, until psa_aead_verify() has returned #PSA_SUCCESS,"]
    #[doc = "          there is no guarantee that the input is valid. Therefore, until"]
    #[doc = "          you have called psa_aead_verify() and it has returned #PSA_SUCCESS,"]
    #[doc = "          treat the input as untrusted and prepare to undo any action that"]
    #[doc = "          depends on the input if psa_aead_verify() returns an error status."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param[in] input             Buffer containing the fragment of"]
    #[doc = "                              additional data."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, have a nonce"]
    #[doc = "         set, have lengths set if required by the algorithm, and"]
    #[doc = "         psa_aead_update() must not have been called yet)."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total input length overflows the additional data length that"]
    #[doc = "         was previously specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_update_ad(
        operation: *mut psa_aead_operation_t,
        input: *const u8,
        input_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Encrypt or decrypt a message fragment in an active AEAD operation."]
    #[doc = ""]
    #[doc = " Before calling this function, you must:"]
    #[doc = " 1. Call either psa_aead_encrypt_setup() or psa_aead_decrypt_setup()."]
    #[doc = "    The choice of setup function determines whether this function"]
    #[doc = "    encrypts or decrypts its input."]
    #[doc = " 2. Set the nonce with psa_aead_generate_nonce() or psa_aead_set_nonce()."]
    #[doc = " 3. Call psa_aead_update_ad() to pass all the additional data."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\warning When decrypting, until psa_aead_verify() has returned #PSA_SUCCESS,"]
    #[doc = "          there is no guarantee that the input is valid. Therefore, until"]
    #[doc = "          you have called psa_aead_verify() and it has returned #PSA_SUCCESS:"]
    #[doc = "          - Do not use the output in any way other than storing it in a"]
    #[doc = "            confidential location. If you take any action that depends"]
    #[doc = "            on the tentative decrypted data, this action will need to be"]
    #[doc = "            undone if the input turns out not to be valid. Furthermore,"]
    #[doc = "            if an adversary can observe that this action took place"]
    #[doc = "            (for example through timing), they may be able to use this"]
    #[doc = "            fact as an oracle to decrypt any message encrypted with the"]
    #[doc = "            same key."]
    #[doc = "          - In particular, do not copy the output anywhere but to a"]
    #[doc = "            memory or storage space that you have exclusive access to."]
    #[doc = ""]
    #[doc = " This function does not require the input to be aligned to any"]
    #[doc = " particular block boundary. If the implementation can only process"]
    #[doc = " a whole block at a time, it must consume all the input provided, but"]
    #[doc = " it may delay the end of the corresponding output until a subsequent"]
    #[doc = " call to psa_aead_update(), psa_aead_finish() or psa_aead_verify()"]
    #[doc = " provides sufficient input. The amount of data that can be delayed"]
    #[doc = " in this way is bounded by #PSA_AEAD_UPDATE_OUTPUT_SIZE."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param[in] input             Buffer containing the message fragment to"]
    #[doc = "                              encrypt or decrypt."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] output           Buffer where the output is to be written."]
    #[doc = " \\param output_size           Size of the \\p output buffer in bytes."]
    #[doc = "                              This must be appropriate for the selected"]
    #[doc = "                                algorithm and key:"]
    #[doc = "                                - A sufficient output size is"]
    #[doc = "                                  #PSA_AEAD_UPDATE_OUTPUT_SIZE(\\c key_type,"]
    #[doc = "                                  \\c alg, \\p input_length) where"]
    #[doc = "                                  \\c key_type is the type of key and \\c alg is"]
    #[doc = "                                  the algorithm that were used to set up the"]
    #[doc = "                                  operation."]
    #[doc = "                                - #PSA_AEAD_UPDATE_OUTPUT_MAX_SIZE(\\p"]
    #[doc = "                                  input_length) evaluates to the maximum"]
    #[doc = "                                  output size of any supported AEAD"]
    #[doc = "                                  algorithm."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the returned output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active, have a nonce"]
    #[doc = "         set, and have lengths set if required by the algorithm)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p output buffer is too small."]
    #[doc = "         #PSA_AEAD_UPDATE_OUTPUT_SIZE(\\c key_type, \\c alg, \\p input_length) or"]
    #[doc = "         #PSA_AEAD_UPDATE_OUTPUT_MAX_SIZE(\\p input_length) can be used to"]
    #[doc = "         determine the required buffer size."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total length of input to psa_aead_update_ad() so far is"]
    #[doc = "         less than the additional data length that was previously"]
    #[doc = "         specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total input length overflows the plaintext length that"]
    #[doc = "         was previously specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_update(
        operation: *mut psa_aead_operation_t,
        input: *const u8,
        input_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish encrypting a message in an AEAD operation."]
    #[doc = ""]
    #[doc = " The operation must have been set up with psa_aead_encrypt_setup()."]
    #[doc = ""]
    #[doc = " This function finishes the authentication of the additional data"]
    #[doc = " formed by concatenating the inputs passed to preceding calls to"]
    #[doc = " psa_aead_update_ad() with the plaintext formed by concatenating the"]
    #[doc = " inputs passed to preceding calls to psa_aead_update()."]
    #[doc = ""]
    #[doc = " This function has two output buffers:"]
    #[doc = " - \\p ciphertext contains trailing ciphertext that was buffered from"]
    #[doc = "   preceding calls to psa_aead_update()."]
    #[doc = " - \\p tag contains the authentication tag."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param[out] ciphertext       Buffer where the last part of the ciphertext"]
    #[doc = "                              is to be written."]
    #[doc = " \\param ciphertext_size       Size of the \\p ciphertext buffer in bytes."]
    #[doc = "                              This must be appropriate for the selected"]
    #[doc = "                              algorithm and key:"]
    #[doc = "                              - A sufficient output size is"]
    #[doc = "                                #PSA_AEAD_FINISH_OUTPUT_SIZE(\\c key_type,"]
    #[doc = "                                \\c alg) where \\c key_type is the type of key"]
    #[doc = "                                and \\c alg is the algorithm that were used to"]
    #[doc = "                                set up the operation."]
    #[doc = "                              - #PSA_AEAD_FINISH_OUTPUT_MAX_SIZE evaluates to"]
    #[doc = "                                the maximum output size of any supported AEAD"]
    #[doc = "                                algorithm."]
    #[doc = " \\param[out] ciphertext_length On success, the number of bytes of"]
    #[doc = "                              returned ciphertext."]
    #[doc = " \\param[out] tag              Buffer where the authentication tag is"]
    #[doc = "                              to be written."]
    #[doc = " \\param tag_size              Size of the \\p tag buffer in bytes."]
    #[doc = "                              This must be appropriate for the selected"]
    #[doc = "                              algorithm and key:"]
    #[doc = "                              - The exact tag size is #PSA_AEAD_TAG_LENGTH(\\c"]
    #[doc = "                                key_type, \\c key_bits, \\c alg) where"]
    #[doc = "                                \\c key_type and \\c key_bits are the type and"]
    #[doc = "                                bit-size of the key, and \\c alg is the"]
    #[doc = "                                algorithm that were used in the call to"]
    #[doc = "                                psa_aead_encrypt_setup()."]
    #[doc = "                              - #PSA_AEAD_TAG_MAX_SIZE evaluates to the"]
    #[doc = "                                maximum tag size of any supported AEAD"]
    #[doc = "                                algorithm."]
    #[doc = " \\param[out] tag_length       On success, the number of bytes"]
    #[doc = "                              that make up the returned tag."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be an active encryption"]
    #[doc = "         operation with a nonce set)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p ciphertext or \\p tag buffer is too small."]
    #[doc = "         #PSA_AEAD_FINISH_OUTPUT_SIZE(\\c key_type, \\c alg) or"]
    #[doc = "         #PSA_AEAD_FINISH_OUTPUT_MAX_SIZE can be used to determine the"]
    #[doc = "         required \\p ciphertext buffer size. #PSA_AEAD_TAG_LENGTH(\\c key_type,"]
    #[doc = "         \\c key_bits, \\c alg) or #PSA_AEAD_TAG_MAX_SIZE can be used to"]
    #[doc = "         determine the required \\p tag buffer size."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total length of input to psa_aead_update_ad() so far is"]
    #[doc = "         less than the additional data length that was previously"]
    #[doc = "         specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total length of input to psa_aead_update() so far is"]
    #[doc = "         less than the plaintext length that was previously"]
    #[doc = "         specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_finish(
        operation: *mut psa_aead_operation_t,
        ciphertext: *mut u8,
        ciphertext_size: size_t,
        ciphertext_length: *mut size_t,
        tag: *mut u8,
        tag_size: size_t,
        tag_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Finish authenticating and decrypting a message in an AEAD operation."]
    #[doc = ""]
    #[doc = " The operation must have been set up with psa_aead_decrypt_setup()."]
    #[doc = ""]
    #[doc = " This function finishes the authenticated decryption of the message"]
    #[doc = " components:"]
    #[doc = ""]
    #[doc = " -  The additional data consisting of the concatenation of the inputs"]
    #[doc = "    passed to preceding calls to psa_aead_update_ad()."]
    #[doc = " -  The ciphertext consisting of the concatenation of the inputs passed to"]
    #[doc = "    preceding calls to psa_aead_update()."]
    #[doc = " -  The tag passed to this function call."]
    #[doc = ""]
    #[doc = " If the authentication tag is correct, this function outputs any remaining"]
    #[doc = " plaintext and reports success. If the authentication tag is not correct,"]
    #[doc = " this function returns #PSA_ERROR_INVALID_SIGNATURE."]
    #[doc = ""]
    #[doc = " When this function returns successfuly, the operation becomes inactive."]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_aead_abort()."]
    #[doc = ""]
    #[doc = " \\note Implementations shall make the best effort to ensure that the"]
    #[doc = " comparison between the actual tag and the expected tag is performed"]
    #[doc = " in constant time."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Active AEAD operation."]
    #[doc = " \\param[out] plaintext        Buffer where the last part of the plaintext"]
    #[doc = "                              is to be written. This is the remaining data"]
    #[doc = "                              from previous calls to psa_aead_update()"]
    #[doc = "                              that could not be processed until the end"]
    #[doc = "                              of the input."]
    #[doc = " \\param plaintext_size        Size of the \\p plaintext buffer in bytes."]
    #[doc = "                              This must be appropriate for the selected algorithm and key:"]
    #[doc = "                              - A sufficient output size is"]
    #[doc = "                                #PSA_AEAD_VERIFY_OUTPUT_SIZE(\\c key_type,"]
    #[doc = "                                \\c alg) where \\c key_type is the type of key"]
    #[doc = "                                and \\c alg is the algorithm that were used to"]
    #[doc = "                                set up the operation."]
    #[doc = "                              - #PSA_AEAD_VERIFY_OUTPUT_MAX_SIZE evaluates to"]
    #[doc = "                                the maximum output size of any supported AEAD"]
    #[doc = "                                algorithm."]
    #[doc = " \\param[out] plaintext_length On success, the number of bytes of"]
    #[doc = "                              returned plaintext."]
    #[doc = " \\param[in] tag               Buffer containing the authentication tag."]
    #[doc = " \\param tag_length            Size of the \\p tag buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The calculations were successful, but the authentication tag is"]
    #[doc = "         not correct."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be an active decryption"]
    #[doc = "         operation with a nonce set)."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p plaintext buffer is too small."]
    #[doc = "         #PSA_AEAD_VERIFY_OUTPUT_SIZE(\\c key_type, \\c alg) or"]
    #[doc = "         #PSA_AEAD_VERIFY_OUTPUT_MAX_SIZE can be used to determine the"]
    #[doc = "         required buffer size."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total length of input to psa_aead_update_ad() so far is"]
    #[doc = "         less than the additional data length that was previously"]
    #[doc = "         specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The total length of input to psa_aead_update() so far is"]
    #[doc = "         less than the plaintext length that was previously"]
    #[doc = "         specified with psa_aead_set_lengths()."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_verify(
        operation: *mut psa_aead_operation_t,
        plaintext: *mut u8,
        plaintext_size: size_t,
        plaintext_length: *mut size_t,
        tag: *const u8,
        tag_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Abort an AEAD operation."]
    #[doc = ""]
    #[doc = " Aborting an operation frees all associated resources except for the"]
    #[doc = " \\p operation structure itself. Once aborted, the operation object"]
    #[doc = " can be reused for another operation by calling"]
    #[doc = " psa_aead_encrypt_setup() or psa_aead_decrypt_setup() again."]
    #[doc = ""]
    #[doc = " You may call this function any time after the operation object has"]
    #[doc = " been initialized as described in #psa_aead_operation_t."]
    #[doc = ""]
    #[doc = " In particular, calling psa_aead_abort() after the operation has been"]
    #[doc = " terminated by a call to psa_aead_abort(), psa_aead_finish() or"]
    #[doc = " psa_aead_verify() is safe and has no effect."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation     Initialized AEAD operation."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_aead_abort(operation: *mut psa_aead_operation_t) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Sign a message with a private key. For hash-and-sign algorithms,"]
    #[doc = "        this includes the hashing step."]
    #[doc = ""]
    #[doc = " \\note To perform a multi-part hash-and-sign signature algorithm, first use"]
    #[doc = "       a multi-part hash operation and then pass the resulting hash to"]
    #[doc = "       psa_sign_hash(). PSA_ALG_GET_HASH(\\p alg) can be used to determine the"]
    #[doc = "       hash algorithm to use."]
    #[doc = ""]
    #[doc = " \\param[in]  key              Identifier of the key to use for the operation."]
    #[doc = "                              It must be an asymmetric key pair. The key must"]
    #[doc = "                              allow the usage #PSA_KEY_USAGE_SIGN_MESSAGE."]
    #[doc = " \\param[in]  alg              An asymmetric signature algorithm (PSA_ALG_XXX"]
    #[doc = "                              value such that #PSA_ALG_IS_SIGN_MESSAGE(\\p alg)"]
    #[doc = "                              is true), that is compatible with the type of"]
    #[doc = "                              \\p key."]
    #[doc = " \\param[in]  input            The input message to sign."]
    #[doc = " \\param[in]  input_length     Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] signature        Buffer where the signature is to be written."]
    #[doc = " \\param[in]  signature_size   Size of the \\p signature buffer in bytes. This"]
    #[doc = "                              must be appropriate for the selected"]
    #[doc = "                              algorithm and key:"]
    #[doc = "                              - The required signature size is"]
    #[doc = "                                #PSA_SIGN_OUTPUT_SIZE(\\c key_type, \\c key_bits, \\p alg)"]
    #[doc = "                                where \\c key_type and \\c key_bits are the type and"]
    #[doc = "                                bit-size respectively of key."]
    #[doc = "                              - #PSA_SIGNATURE_MAX_SIZE evaluates to the"]
    #[doc = "                                maximum signature size of any supported"]
    #[doc = "                                signature algorithm."]
    #[doc = " \\param[out] signature_length On success, the number of bytes that make up"]
    #[doc = "                              the returned signature value."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The key does not have the #PSA_KEY_USAGE_SIGN_MESSAGE flag,"]
    #[doc = "         or it does not permit the requested algorithm."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p signature buffer is too small. You can"]
    #[doc = "         determine a sufficient buffer size by calling"]
    #[doc = "         #PSA_SIGN_OUTPUT_SIZE(\\c key_type, \\c key_bits, \\p alg)"]
    #[doc = "         where \\c key_type and \\c key_bits are the type and bit-size"]
    #[doc = "         respectively of \\p key."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_sign_message(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        signature: *mut u8,
        signature_size: size_t,
        signature_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Verify the signature of a message with a public key, using"]
    #[doc = "         a hash-and-sign verification algorithm."]
    #[doc = ""]
    #[doc = " \\note To perform a multi-part hash-and-sign signature verification"]
    #[doc = "       algorithm, first use a multi-part hash operation to hash the message"]
    #[doc = "       and then pass the resulting hash to psa_verify_hash()."]
    #[doc = "       PSA_ALG_GET_HASH(\\p alg) can be used to determine the hash algorithm"]
    #[doc = "       to use."]
    #[doc = ""]
    #[doc = " \\param[in]  key              Identifier of the key to use for the operation."]
    #[doc = "                              It must be a public key or an asymmetric key"]
    #[doc = "                              pair. The key must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_VERIFY_MESSAGE."]
    #[doc = " \\param[in]  alg              An asymmetric signature algorithm (PSA_ALG_XXX"]
    #[doc = "                              value such that #PSA_ALG_IS_SIGN_MESSAGE(\\p alg)"]
    #[doc = "                              is true), that is compatible with the type of"]
    #[doc = "                              \\p key."]
    #[doc = " \\param[in]  input            The message whose signature is to be verified."]
    #[doc = " \\param[in]  input_length     Size of the \\p input buffer in bytes."]
    #[doc = " \\param[out] signature        Buffer containing the signature to verify."]
    #[doc = " \\param[in]  signature_length Size of the \\p signature buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The key does not have the #PSA_KEY_USAGE_SIGN_MESSAGE flag,"]
    #[doc = "         or it does not permit the requested algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The calculation was performed successfully, but the passed signature"]
    #[doc = "         is not a valid signature."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_verify_message(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        signature: *const u8,
        signature_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Sign a hash or short message with a private key."]
    #[doc = ""]
    #[doc = " Note that to perform a hash-and-sign signature algorithm, you must"]
    #[doc = " first calculate the hash by calling psa_hash_setup(), psa_hash_update()"]
    #[doc = " and psa_hash_finish(), or alternatively by calling psa_hash_compute()."]
    #[doc = " Then pass the resulting hash as the \\p hash"]
    #[doc = " parameter to this function. You can use #PSA_ALG_SIGN_GET_HASH(\\p alg)"]
    #[doc = " to determine the hash algorithm to use."]
    #[doc = ""]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must be an asymmetric key pair. The key must"]
    #[doc = "                              allow the usage #PSA_KEY_USAGE_SIGN_HASH."]
    #[doc = " \\param alg                   A signature algorithm (PSA_ALG_XXX"]
    #[doc = "                              value such that #PSA_ALG_IS_SIGN_HASH(\\p alg)"]
    #[doc = "                              is true), that is compatible with"]
    #[doc = "                              the type of \\p key."]
    #[doc = " \\param[in] hash              The hash or message to sign."]
    #[doc = " \\param hash_length           Size of the \\p hash buffer in bytes."]
    #[doc = " \\param[out] signature        Buffer where the signature is to be written."]
    #[doc = " \\param signature_size        Size of the \\p signature buffer in bytes."]
    #[doc = " \\param[out] signature_length On success, the number of bytes"]
    #[doc = "                              that make up the returned signature value."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p signature buffer is too small. You can"]
    #[doc = "         determine a sufficient buffer size by calling"]
    #[doc = "         #PSA_SIGN_OUTPUT_SIZE(\\c key_type, \\c key_bits, \\p alg)"]
    #[doc = "         where \\c key_type and \\c key_bits are the type and bit-size"]
    #[doc = "         respectively of \\p key."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_sign_hash(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        hash: *const u8,
        hash_length: size_t,
        signature: *mut u8,
        signature_size: size_t,
        signature_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Verify the signature of a hash or short message using a public key."]
    #[doc = ""]
    #[doc = " Note that to perform a hash-and-sign signature algorithm, you must"]
    #[doc = " first calculate the hash by calling psa_hash_setup(), psa_hash_update()"]
    #[doc = " and psa_hash_finish(), or alternatively by calling psa_hash_compute()."]
    #[doc = " Then pass the resulting hash as the \\p hash"]
    #[doc = " parameter to this function. You can use #PSA_ALG_SIGN_GET_HASH(\\p alg)"]
    #[doc = " to determine the hash algorithm to use."]
    #[doc = ""]
    #[doc = " \\param key               Identifier of the key to use for the operation. It"]
    #[doc = "                          must be a public key or an asymmetric key pair. The"]
    #[doc = "                          key must allow the usage"]
    #[doc = "                          #PSA_KEY_USAGE_VERIFY_HASH."]
    #[doc = " \\param alg               A signature algorithm (PSA_ALG_XXX"]
    #[doc = "                          value such that #PSA_ALG_IS_SIGN_HASH(\\p alg)"]
    #[doc = "                          is true), that is compatible with"]
    #[doc = "                          the type of \\p key."]
    #[doc = " \\param[in] hash          The hash or message whose signature is to be"]
    #[doc = "                          verified."]
    #[doc = " \\param hash_length       Size of the \\p hash buffer in bytes."]
    #[doc = " \\param[in] signature     Buffer containing the signature to verify."]
    #[doc = " \\param signature_length  Size of the \\p signature buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         The signature is valid."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The calculation was perfomed successfully, but the passed"]
    #[doc = "         signature is not a valid signature."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_verify_hash(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        hash: *const u8,
        hash_length: size_t,
        signature: *const u8,
        signature_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Encrypt a short message with a public key."]
    #[doc = ""]
    #[doc = " \\param key                   Identifer of the key to use for the operation."]
    #[doc = "                              It must be a public key or an asymmetric key"]
    #[doc = "                              pair. It must allow the usage"]
    #[doc = "                              #PSA_KEY_USAGE_ENCRYPT."]
    #[doc = " \\param alg                   An asymmetric encryption algorithm that is"]
    #[doc = "                              compatible with the type of \\p key."]
    #[doc = " \\param[in] input             The message to encrypt."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = " \\param[in] salt              A salt or label, if supported by the"]
    #[doc = "                              encryption algorithm."]
    #[doc = "                              If the algorithm does not support a"]
    #[doc = "                              salt, pass \\c NULL."]
    #[doc = "                              If the algorithm supports an optional"]
    #[doc = "                              salt and you do not want to pass a salt,"]
    #[doc = "                              pass \\c NULL."]
    #[doc = ""]
    #[doc = "                              - For #PSA_ALG_RSA_PKCS1V15_CRYPT, no salt is"]
    #[doc = "                                supported."]
    #[doc = " \\param salt_length           Size of the \\p salt buffer in bytes."]
    #[doc = "                              If \\p salt is \\c NULL, pass 0."]
    #[doc = " \\param[out] output           Buffer where the encrypted message is to"]
    #[doc = "                              be written."]
    #[doc = " \\param output_size           Size of the \\p output buffer in bytes."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the returned output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p output buffer is too small. You can"]
    #[doc = "         determine a sufficient buffer size by calling"]
    #[doc = "         #PSA_ASYMMETRIC_ENCRYPT_OUTPUT_SIZE(\\c key_type, \\c key_bits, \\p alg)"]
    #[doc = "         where \\c key_type and \\c key_bits are the type and bit-size"]
    #[doc = "         respectively of \\p key."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_asymmetric_encrypt(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        salt: *const u8,
        salt_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Decrypt a short message with a private key."]
    #[doc = ""]
    #[doc = " \\param key                   Identifier of the key to use for the operation."]
    #[doc = "                              It must be an asymmetric key pair. It must"]
    #[doc = "                              allow the usage #PSA_KEY_USAGE_DECRYPT."]
    #[doc = " \\param alg                   An asymmetric encryption algorithm that is"]
    #[doc = "                              compatible with the type of \\p key."]
    #[doc = " \\param[in] input             The message to decrypt."]
    #[doc = " \\param input_length          Size of the \\p input buffer in bytes."]
    #[doc = " \\param[in] salt              A salt or label, if supported by the"]
    #[doc = "                              encryption algorithm."]
    #[doc = "                              If the algorithm does not support a"]
    #[doc = "                              salt, pass \\c NULL."]
    #[doc = "                              If the algorithm supports an optional"]
    #[doc = "                              salt and you do not want to pass a salt,"]
    #[doc = "                              pass \\c NULL."]
    #[doc = ""]
    #[doc = "                              - For #PSA_ALG_RSA_PKCS1V15_CRYPT, no salt is"]
    #[doc = "                                supported."]
    #[doc = " \\param salt_length           Size of the \\p salt buffer in bytes."]
    #[doc = "                              If \\p salt is \\c NULL, pass 0."]
    #[doc = " \\param[out] output           Buffer where the decrypted message is to"]
    #[doc = "                              be written."]
    #[doc = " \\param output_size           Size of the \\c output buffer in bytes."]
    #[doc = " \\param[out] output_length    On success, the number of bytes"]
    #[doc = "                              that make up the returned output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         The size of the \\p output buffer is too small. You can"]
    #[doc = "         determine a sufficient buffer size by calling"]
    #[doc = "         #PSA_ASYMMETRIC_DECRYPT_OUTPUT_SIZE(\\c key_type, \\c key_bits, \\p alg)"]
    #[doc = "         where \\c key_type and \\c key_bits are the type and bit-size"]
    #[doc = "         respectively of \\p key."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_INVALID_PADDING"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_asymmetric_decrypt(
        key: psa_key_id_t,
        alg: psa_algorithm_t,
        input: *const u8,
        input_length: size_t,
        salt: *const u8,
        salt_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
#[doc = " The type of the state data structure for key derivation operations."]
#[doc = ""]
#[doc = " Before calling any function on a key derivation operation object, the"]
#[doc = " application must initialize it by any of the following means:"]
#[doc = " - Set the structure to all-bits-zero, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_derivation_operation_t operation;"]
#[doc = "   memset(&operation, 0, sizeof(operation));"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to logical zero values, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_derivation_operation_t operation = {0};"]
#[doc = "   \\endcode"]
#[doc = " - Initialize the structure to the initializer #PSA_KEY_DERIVATION_OPERATION_INIT,"]
#[doc = "   for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_derivation_operation_t operation = PSA_KEY_DERIVATION_OPERATION_INIT;"]
#[doc = "   \\endcode"]
#[doc = " - Assign the result of the function psa_key_derivation_operation_init()"]
#[doc = "   to the structure, for example:"]
#[doc = "   \\code"]
#[doc = "   psa_key_derivation_operation_t operation;"]
#[doc = "   operation = psa_key_derivation_operation_init();"]
#[doc = "   \\endcode"]
#[doc = ""]
#[doc = " This is an implementation-defined \\c struct. Applications should not"]
#[doc = " make any assumptions about the content of this structure."]
#[doc = " Implementation details can change in future versions without notice."]
pub type psa_key_derivation_operation_t = psa_key_derivation_s;
extern "C" {
    #[doc = " Set up a key derivation operation."]
    #[doc = ""]
    #[doc = " A key derivation algorithm takes some inputs and uses them to generate"]
    #[doc = " a byte stream in a deterministic way."]
    #[doc = " This byte stream can be used to produce keys and other"]
    #[doc = " cryptographic material."]
    #[doc = ""]
    #[doc = " To derive a key:"]
    #[doc = " -# Start with an initialized object of type #psa_key_derivation_operation_t."]
    #[doc = " -# Call psa_key_derivation_setup() to select the algorithm."]
    #[doc = " -# Provide the inputs for the key derivation by calling"]
    #[doc = "    psa_key_derivation_input_bytes() or psa_key_derivation_input_key()"]
    #[doc = "    as appropriate. Which inputs are needed, in what order, and whether"]
    #[doc = "    they may be keys and if so of what type depends on the algorithm."]
    #[doc = " -# Optionally set the operation's maximum capacity with"]
    #[doc = "    psa_key_derivation_set_capacity(). You may do this before, in the middle"]
    #[doc = "    of or after providing inputs. For some algorithms, this step is mandatory"]
    #[doc = "    because the output depends on the maximum capacity."]
    #[doc = " -# To derive a key, call psa_key_derivation_output_key()."]
    #[doc = "    To derive a byte string for a different purpose, call"]
    #[doc = "    psa_key_derivation_output_bytes()."]
    #[doc = "    Successive calls to these functions use successive output bytes"]
    #[doc = "    calculated by the key derivation algorithm."]
    #[doc = " -# Clean up the key derivation operation object with"]
    #[doc = "    psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " If this function returns an error, the key derivation operation object is"]
    #[doc = " not changed."]
    #[doc = ""]
    #[doc = " If an error occurs at any step after a call to psa_key_derivation_setup(),"]
    #[doc = " the operation will need to be reset by a call to psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " Implementations must reject an attempt to derive a key of size 0."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation       The key derivation operation object"]
    #[doc = "                                to set up. It must"]
    #[doc = "                                have been initialized but not set up yet."]
    #[doc = " \\param alg                     The key derivation algorithm to compute"]
    #[doc = "                                (\\c PSA_ALG_XXX value such that"]
    #[doc = "                                #PSA_ALG_IS_KEY_DERIVATION(\\p alg) is true)."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c alg is not a key derivation algorithm."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\c alg is not supported or is not a key derivation algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be inactive)."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_setup(
        operation: *mut psa_key_derivation_operation_t,
        alg: psa_algorithm_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Retrieve the current capacity of a key derivation operation."]
    #[doc = ""]
    #[doc = " The capacity of a key derivation is the maximum number of bytes that it can"]
    #[doc = " return. When you get *N* bytes of output from a key derivation operation,"]
    #[doc = " this reduces its capacity by *N*."]
    #[doc = ""]
    #[doc = " \\param[in] operation     The operation to query."]
    #[doc = " \\param[out] capacity     On success, the capacity of the operation."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active)."]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_get_capacity(
        operation: *const psa_key_derivation_operation_t,
        capacity: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Set the maximum capacity of a key derivation operation."]
    #[doc = ""]
    #[doc = " The capacity of a key derivation operation is the maximum number of bytes"]
    #[doc = " that the key derivation operation can return from this point onwards."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The key derivation operation object to modify."]
    #[doc = " \\param capacity          The new capacity of the operation."]
    #[doc = "                          It must be less or equal to the operation's"]
    #[doc = "                          current capacity."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p capacity is larger than the operation's current capacity."]
    #[doc = "         In this case, the operation object remains valid and its capacity"]
    #[doc = "         remains unchanged."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active)."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_set_capacity(
        operation: *mut psa_key_derivation_operation_t,
        capacity: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Provide an input for key derivation or key agreement."]
    #[doc = ""]
    #[doc = " Which inputs are required and in what order depends on the algorithm."]
    #[doc = " Refer to the documentation of each key derivation or key agreement"]
    #[doc = " algorithm for information."]
    #[doc = ""]
    #[doc = " This function passes direct inputs, which is usually correct for"]
    #[doc = " non-secret inputs. To pass a secret input, which should be in a key"]
    #[doc = " object, call psa_key_derivation_input_key() instead of this function."]
    #[doc = " Refer to the documentation of individual step types"]
    #[doc = " (`PSA_KEY_DERIVATION_INPUT_xxx` values of type ::psa_key_derivation_step_t)"]
    #[doc = " for more information."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation       The key derivation operation object to use."]
    #[doc = "                                It must have been set up with"]
    #[doc = "                                psa_key_derivation_setup() and must not"]
    #[doc = "                                have produced any output yet."]
    #[doc = " \\param step                    Which step the input data is for."]
    #[doc = " \\param[in] data                Input data to use."]
    #[doc = " \\param data_length             Size of the \\p data buffer in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step is not compatible with the operation's algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step does not allow direct inputs."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid for this input \\p step."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_input_bytes(
        operation: *mut psa_key_derivation_operation_t,
        step: psa_key_derivation_step_t,
        data: *const u8,
        data_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Provide a numeric input for key derivation or key agreement."]
    #[doc = ""]
    #[doc = " Which inputs are required and in what order depends on the algorithm."]
    #[doc = " However, when an algorithm requires a particular order, numeric inputs"]
    #[doc = " usually come first as they tend to be configuration parameters."]
    #[doc = " Refer to the documentation of each key derivation or key agreement"]
    #[doc = " algorithm for information."]
    #[doc = ""]
    #[doc = " This function is used for inputs which are fixed-size non-negative"]
    #[doc = " integers."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation       The key derivation operation object to use."]
    #[doc = "                                It must have been set up with"]
    #[doc = "                                psa_key_derivation_setup() and must not"]
    #[doc = "                                have produced any output yet."]
    #[doc = " \\param step                    Which step the input data is for."]
    #[doc = " \\param[in] value               The value of the numeric input."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step is not compatible with the operation's algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step does not allow numeric inputs."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid for this input \\p step."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_input_integer(
        operation: *mut psa_key_derivation_operation_t,
        step: psa_key_derivation_step_t,
        value: u64,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Provide an input for key derivation in the form of a key."]
    #[doc = ""]
    #[doc = " Which inputs are required and in what order depends on the algorithm."]
    #[doc = " Refer to the documentation of each key derivation or key agreement"]
    #[doc = " algorithm for information."]
    #[doc = ""]
    #[doc = " This function obtains input from a key object, which is usually correct for"]
    #[doc = " secret inputs or for non-secret personalization strings kept in the key"]
    #[doc = " store. To pass a non-secret parameter which is not in the key store,"]
    #[doc = " call psa_key_derivation_input_bytes() instead of this function."]
    #[doc = " Refer to the documentation of individual step types"]
    #[doc = " (`PSA_KEY_DERIVATION_INPUT_xxx` values of type ::psa_key_derivation_step_t)"]
    #[doc = " for more information."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation       The key derivation operation object to use."]
    #[doc = "                                It must have been set up with"]
    #[doc = "                                psa_key_derivation_setup() and must not"]
    #[doc = "                                have produced any output yet."]
    #[doc = " \\param step                    Which step the input data is for."]
    #[doc = " \\param key                     Identifier of the key. It must have an"]
    #[doc = "                                appropriate type for step and must allow the"]
    #[doc = "                                usage #PSA_KEY_USAGE_DERIVE or"]
    #[doc = "                                #PSA_KEY_USAGE_VERIFY_DERIVATION (see note)"]
    #[doc = "                                and the algorithm used by the operation."]
    #[doc = ""]
    #[doc = " \\note Once all inputs steps are completed, the operations will allow:"]
    #[doc = " - psa_key_derivation_output_bytes() if each input was either a direct input"]
    #[doc = "   or  a key with #PSA_KEY_USAGE_DERIVE set;"]
    #[doc = " - psa_key_derivation_output_key() if the input for step"]
    #[doc = "   #PSA_KEY_DERIVATION_INPUT_SECRET or #PSA_KEY_DERIVATION_INPUT_PASSWORD"]
    #[doc = "   was from a key slot with #PSA_KEY_USAGE_DERIVE and each other input was"]
    #[doc = "   either a direct input or a key with #PSA_KEY_USAGE_DERIVE set;"]
    #[doc = " - psa_key_derivation_verify_bytes() if each input was either a direct input"]
    #[doc = "   or  a key with #PSA_KEY_USAGE_VERIFY_DERIVATION set;"]
    #[doc = " - psa_key_derivation_verify_key() under the same conditions as"]
    #[doc = "   psa_key_derivation_verify_bytes()."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The key allows neither #PSA_KEY_USAGE_DERIVE nor"]
    #[doc = "         #PSA_KEY_USAGE_VERIFY_DERIVATION, or it doesn't allow this"]
    #[doc = "         algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step is not compatible with the operation's algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step does not allow key inputs of the given type"]
    #[doc = "         or does not allow key inputs at all."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid for this input \\p step."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_input_key(
        operation: *mut psa_key_derivation_operation_t,
        step: psa_key_derivation_step_t,
        key: psa_key_id_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Perform a key agreement and use the shared secret as input to a key"]
    #[doc = " derivation."]
    #[doc = ""]
    #[doc = " A key agreement algorithm takes two inputs: a private key \\p private_key"]
    #[doc = " a public key \\p peer_key."]
    #[doc = " The result of this function is passed as input to a key derivation."]
    #[doc = " The output of this key derivation can be extracted by reading from the"]
    #[doc = " resulting operation to produce keys and other cryptographic material."]
    #[doc = ""]
    #[doc = " If this function returns an error status, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation       The key derivation operation object to use."]
    #[doc = "                                It must have been set up with"]
    #[doc = "                                psa_key_derivation_setup() with a"]
    #[doc = "                                key agreement and derivation algorithm"]
    #[doc = "                                \\c alg (\\c PSA_ALG_XXX value such that"]
    #[doc = "                                #PSA_ALG_IS_KEY_AGREEMENT(\\c alg) is true"]
    #[doc = "                                and #PSA_ALG_IS_RAW_KEY_AGREEMENT(\\c alg)"]
    #[doc = "                                is false)."]
    #[doc = "                                The operation must be ready for an"]
    #[doc = "                                input of the type given by \\p step."]
    #[doc = " \\param step                    Which step the input data is for."]
    #[doc = " \\param private_key             Identifier of the private key to use. It must"]
    #[doc = "                                allow the usage #PSA_KEY_USAGE_DERIVE."]
    #[doc = " \\param[in] peer_key      Public key of the peer. The peer key must be in the"]
    #[doc = "                          same format that psa_import_key() accepts for the"]
    #[doc = "                          public key type corresponding to the type of"]
    #[doc = "                          private_key. That is, this function performs the"]
    #[doc = "                          equivalent of"]
    #[doc = "                          #psa_import_key(...,"]
    #[doc = "                          `peer_key`, `peer_key_length`) where"]
    #[doc = "                          with key attributes indicating the public key"]
    #[doc = "                          type corresponding to the type of `private_key`."]
    #[doc = "                          For example, for EC keys, this means that peer_key"]
    #[doc = "                          is interpreted as a point on the curve that the"]
    #[doc = "                          private key is on. The standard formats for public"]
    #[doc = "                          keys are documented in the documentation of"]
    #[doc = "                          psa_export_public_key()."]
    #[doc = " \\param peer_key_length         Size of \\p peer_key in bytes."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid for this key agreement \\p step."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c private_key is not compatible with \\c alg,"]
    #[doc = "         or \\p peer_key is not valid for \\c alg or not compatible with"]
    #[doc = "         \\c private_key."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\c alg is not supported or is not a key derivation algorithm."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\c step does not allow an input resulting from a key agreement."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_key_agreement(
        operation: *mut psa_key_derivation_operation_t,
        step: psa_key_derivation_step_t,
        private_key: psa_key_id_t,
        peer_key: *const u8,
        peer_key_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Read some data from a key derivation operation."]
    #[doc = ""]
    #[doc = " This function calculates output bytes from a key derivation algorithm and"]
    #[doc = " return those bytes."]
    #[doc = " If you view the key derivation's output as a stream of bytes, this"]
    #[doc = " function destructively reads the requested number of bytes from the"]
    #[doc = " stream."]
    #[doc = " The operation's capacity decreases by the number of bytes read."]
    #[doc = ""]
    #[doc = " If this function returns an error status other than"]
    #[doc = " #PSA_ERROR_INSUFFICIENT_DATA, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The key derivation operation object to read from."]
    #[doc = " \\param[out] output       Buffer where the output will be written."]
    #[doc = " \\param output_length     Number of bytes to output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         One of the inputs was a key whose policy didn't allow"]
    #[doc = "         #PSA_KEY_USAGE_DERIVE."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_DATA"]
    #[doc = "                          The operation's capacity was less than"]
    #[doc = "                          \\p output_length bytes. Note that in this case,"]
    #[doc = "                          no output is written to the output buffer."]
    #[doc = "                          The operation's capacity is set to 0, thus"]
    #[doc = "                          subsequent calls to this function will not"]
    #[doc = "                          succeed, even with a smaller output buffer."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active and completed"]
    #[doc = "         all required input steps)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_output_bytes(
        operation: *mut psa_key_derivation_operation_t,
        output: *mut u8,
        output_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Derive a key from an ongoing key derivation operation."]
    #[doc = ""]
    #[doc = " This function calculates output bytes from a key derivation algorithm"]
    #[doc = " and uses those bytes to generate a key deterministically."]
    #[doc = " The key's location, usage policy, type and size are taken from"]
    #[doc = " \\p attributes."]
    #[doc = ""]
    #[doc = " If you view the key derivation's output as a stream of bytes, this"]
    #[doc = " function destructively reads as many bytes as required from the"]
    #[doc = " stream."]
    #[doc = " The operation's capacity decreases by the number of bytes read."]
    #[doc = ""]
    #[doc = " If this function returns an error status other than"]
    #[doc = " #PSA_ERROR_INSUFFICIENT_DATA, the operation enters an error"]
    #[doc = " state and must be aborted by calling psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " How much output is produced and consumed from the operation, and how"]
    #[doc = " the key is derived, depends on the key type and on the key size"]
    #[doc = " (denoted \\c bits below):"]
    #[doc = ""]
    #[doc = " - For key types for which the key is an arbitrary sequence of bytes"]
    #[doc = "   of a given size, this function is functionally equivalent to"]
    #[doc = "   calling #psa_key_derivation_output_bytes"]
    #[doc = "   and passing the resulting output to #psa_import_key."]
    #[doc = "   However, this function has a security benefit:"]
    #[doc = "   if the implementation provides an isolation boundary then"]
    #[doc = "   the key material is not exposed outside the isolation boundary."]
    #[doc = "   As a consequence, for these key types, this function always consumes"]
    #[doc = "   exactly (\\c bits / 8) bytes from the operation."]
    #[doc = "   The following key types defined in this specification follow this scheme:"]
    #[doc = ""]
    #[doc = "     - #PSA_KEY_TYPE_AES;"]
    #[doc = "     - #PSA_KEY_TYPE_CAMELLIA;"]
    #[doc = "     - #PSA_KEY_TYPE_DERIVE;"]
    #[doc = "     - #PSA_KEY_TYPE_HMAC;"]
    #[doc = "     - #PSA_KEY_TYPE_PASSWORD_HASH."]
    #[doc = ""]
    #[doc = " - For ECC keys on a Montgomery elliptic curve"]
    #[doc = "   (#PSA_KEY_TYPE_ECC_KEY_PAIR(\\c curve) where \\c curve designates a"]
    #[doc = "   Montgomery curve), this function always draws a byte string whose"]
    #[doc = "   length is determined by the curve, and sets the mandatory bits"]
    #[doc = "   accordingly. That is:"]
    #[doc = ""]
    #[doc = "     - Curve25519 (#PSA_ECC_FAMILY_MONTGOMERY, 255 bits): draw a 32-byte"]
    #[doc = "       string and process it as specified in RFC 7748 &sect;5."]
    #[doc = "     - Curve448 (#PSA_ECC_FAMILY_MONTGOMERY, 448 bits): draw a 56-byte"]
    #[doc = "       string and process it as specified in RFC 7748 &sect;5."]
    #[doc = ""]
    #[doc = " - For key types for which the key is represented by a single sequence of"]
    #[doc = "   \\c bits bits with constraints as to which bit sequences are acceptable,"]
    #[doc = "   this function draws a byte string of length (\\c bits / 8) bytes rounded"]
    #[doc = "   up to the nearest whole number of bytes. If the resulting byte string"]
    #[doc = "   is acceptable, it becomes the key, otherwise the drawn bytes are discarded."]
    #[doc = "   This process is repeated until an acceptable byte string is drawn."]
    #[doc = "   The byte string drawn from the operation is interpreted as specified"]
    #[doc = "   for the output produced by psa_export_key()."]
    #[doc = "   The following key types defined in this specification follow this scheme:"]
    #[doc = ""]
    #[doc = "     - #PSA_KEY_TYPE_DES."]
    #[doc = "       Force-set the parity bits, but discard forbidden weak keys."]
    #[doc = "       For 2-key and 3-key triple-DES, the three keys are generated"]
    #[doc = "       successively (for example, for 3-key triple-DES,"]
    #[doc = "       if the first 8 bytes specify a weak key and the next 8 bytes do not,"]
    #[doc = "       discard the first 8 bytes, use the next 8 bytes as the first key,"]
    #[doc = "       and continue reading output from the operation to derive the other"]
    #[doc = "       two keys)."]
    #[doc = "     - Finite-field Diffie-Hellman keys (#PSA_KEY_TYPE_DH_KEY_PAIR(\\c group)"]
    #[doc = "       where \\c group designates any Diffie-Hellman group) and"]
    #[doc = "       ECC keys on a Weierstrass elliptic curve"]
    #[doc = "       (#PSA_KEY_TYPE_ECC_KEY_PAIR(\\c curve) where \\c curve designates a"]
    #[doc = "       Weierstrass curve)."]
    #[doc = "       For these key types, interpret the byte string as integer"]
    #[doc = "       in big-endian order. Discard it if it is not in the range"]
    #[doc = "       [0, *N* - 2] where *N* is the boundary of the private key domain"]
    #[doc = "       (the prime *p* for Diffie-Hellman, the subprime *q* for DSA,"]
    #[doc = "       or the order of the curve's base point for ECC)."]
    #[doc = "       Add 1 to the resulting integer and use this as the private key *x*."]
    #[doc = "       This method allows compliance to NIST standards, specifically"]
    #[doc = "       the methods titled \"key-pair generation by testing candidates\""]
    #[doc = "       in NIST SP 800-56A &sect;5.6.1.1.4 for Diffie-Hellman,"]
    #[doc = "       in FIPS 186-4 &sect;B.1.2 for DSA, and"]
    #[doc = "       in NIST SP 800-56A &sect;5.6.1.2.2 or"]
    #[doc = "       FIPS 186-4 &sect;B.4.2 for elliptic curve keys."]
    #[doc = ""]
    #[doc = " - For other key types, including #PSA_KEY_TYPE_RSA_KEY_PAIR,"]
    #[doc = "   the way in which the operation output is consumed is"]
    #[doc = "   implementation-defined."]
    #[doc = ""]
    #[doc = " In all cases, the data that is read is discarded from the operation."]
    #[doc = " The operation's capacity is decreased by the number of bytes read."]
    #[doc = ""]
    #[doc = " For algorithms that take an input step #PSA_KEY_DERIVATION_INPUT_SECRET,"]
    #[doc = " the input to that step must be provided with psa_key_derivation_input_key()."]
    #[doc = " Future versions of this specification may include additional restrictions"]
    #[doc = " on the derived key based on the attributes and strength of the secret key."]
    #[doc = ""]
    #[doc = " \\param[in] attributes    The attributes for the new key."]
    #[doc = "                          If the key type to be created is"]
    #[doc = "                          #PSA_KEY_TYPE_PASSWORD_HASH then the algorithm in"]
    #[doc = "                          the policy must be the same as in the current"]
    #[doc = "                          operation."]
    #[doc = " \\param[in,out] operation The key derivation operation object to read from."]
    #[doc = " \\param[out] key          On success, an identifier for the newly created"]
    #[doc = "                          key. For persistent keys, this is the key"]
    #[doc = "                          identifier defined in \\p attributes."]
    #[doc = "                          \\c 0 on failure."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = "         If the key is persistent, the key material and the key's metadata"]
    #[doc = "         have been saved to persistent storage."]
    #[doc = " \\retval #PSA_ERROR_ALREADY_EXISTS"]
    #[doc = "         This is an attempt to create a persistent key, and there is"]
    #[doc = "         already a persistent key with the given identifier."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_DATA"]
    #[doc = "         There was not enough data to create the desired key."]
    #[doc = "         Note that in this case, no output is written to the output buffer."]
    #[doc = "         The operation's capacity is set to 0, thus subsequent calls to"]
    #[doc = "         this function will not succeed, even with a smaller output buffer."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         The key type or key size is not supported, either by the"]
    #[doc = "         implementation in general or in this particular location."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The provided key attributes are not valid for the operation."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The #PSA_KEY_DERIVATION_INPUT_SECRET or"]
    #[doc = "         #PSA_KEY_DERIVATION_INPUT_PASSWORD input was not provided through a"]
    #[doc = "         key; or one of the inputs was a key whose policy didn't allow"]
    #[doc = "         #PSA_KEY_USAGE_DERIVE."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active and completed"]
    #[doc = "         all required input steps)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_STORAGE"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_output_key(
        attributes: *const psa_key_attributes_t,
        operation: *mut psa_key_derivation_operation_t,
        key: *mut psa_key_id_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Compare output data from a key derivation operation to an expected value."]
    #[doc = ""]
    #[doc = " This function calculates output bytes from a key derivation algorithm and"]
    #[doc = " compares those bytes to an expected value in constant time."]
    #[doc = " If you view the key derivation's output as a stream of bytes, this"]
    #[doc = " function destructively reads the expected number of bytes from the"]
    #[doc = " stream before comparing them."]
    #[doc = " The operation's capacity decreases by the number of bytes read."]
    #[doc = ""]
    #[doc = " This is functionally equivalent to the following code:"]
    #[doc = " \\code"]
    #[doc = " psa_key_derivation_output_bytes(operation, tmp, output_length);"]
    #[doc = " if (memcmp(output, tmp, output_length) != 0)"]
    #[doc = "     return PSA_ERROR_INVALID_SIGNATURE;"]
    #[doc = " \\endcode"]
    #[doc = " except (1) it works even if the key's policy does not allow outputting the"]
    #[doc = " bytes, and (2) the comparison will be done in constant time."]
    #[doc = ""]
    #[doc = " If this function returns an error status other than"]
    #[doc = " #PSA_ERROR_INSUFFICIENT_DATA or #PSA_ERROR_INVALID_SIGNATURE,"]
    #[doc = " the operation enters an error state and must be aborted by calling"]
    #[doc = " psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The key derivation operation object to read from."]
    #[doc = " \\param[in] expected_output Buffer containing the expected derivation output."]
    #[doc = " \\param output_length     Length ot the expected output; this is also the"]
    #[doc = "                          number of bytes that will be read."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The output was read successfully, but it differs from the expected"]
    #[doc = "         output."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         One of the inputs was a key whose policy didn't allow"]
    #[doc = "         #PSA_KEY_USAGE_VERIFY_DERIVATION."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_DATA"]
    #[doc = "                          The operation's capacity was less than"]
    #[doc = "                          \\p output_length bytes. Note that in this case,"]
    #[doc = "                          the operation's capacity is set to 0, thus"]
    #[doc = "                          subsequent calls to this function will not"]
    #[doc = "                          succeed, even with a smaller expected output."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active and completed"]
    #[doc = "         all required input steps)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_verify_bytes(
        operation: *mut psa_key_derivation_operation_t,
        expected_output: *const u8,
        output_length: size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Compare output data from a key derivation operation to an expected value"]
    #[doc = " stored in a key object."]
    #[doc = ""]
    #[doc = " This function calculates output bytes from a key derivation algorithm and"]
    #[doc = " compares those bytes to an expected value, provided as key of type"]
    #[doc = " #PSA_KEY_TYPE_PASSWORD_HASH."]
    #[doc = " If you view the key derivation's output as a stream of bytes, this"]
    #[doc = " function destructively reads the number of bytes corresponding the the"]
    #[doc = " length of the expected value from the stream before comparing them."]
    #[doc = " The operation's capacity decreases by the number of bytes read."]
    #[doc = ""]
    #[doc = " This is functionally equivalent to exporting the key and calling"]
    #[doc = " psa_key_derivation_verify_bytes() on the result, except that it"]
    #[doc = " works even if the key cannot be exported."]
    #[doc = ""]
    #[doc = " If this function returns an error status other than"]
    #[doc = " #PSA_ERROR_INSUFFICIENT_DATA or #PSA_ERROR_INVALID_SIGNATURE,"]
    #[doc = " the operation enters an error state and must be aborted by calling"]
    #[doc = " psa_key_derivation_abort()."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation The key derivation operation object to read from."]
    #[doc = " \\param[in] expected      A key of type #PSA_KEY_TYPE_PASSWORD_HASH"]
    #[doc = "                          containing the expected output. Its policy must"]
    #[doc = "                          include the #PSA_KEY_USAGE_VERIFY_DERIVATION flag"]
    #[doc = "                          and the permitted algorithm must match the"]
    #[doc = "                          operation. The value of this key was likely"]
    #[doc = "                          computed by a previous call to"]
    #[doc = "                          psa_key_derivation_output_key()."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_INVALID_SIGNATURE"]
    #[doc = "         The output was read successfully, but if differs from the expected"]
    #[doc = "         output."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = "         The key passed as the expected value does not exist."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         The key passed as the expected value has an invalid type."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The key passed as the expected value does not allow this usage or"]
    #[doc = "         this algorithm; or one of the inputs was a key whose policy didn't"]
    #[doc = "         allow #PSA_KEY_USAGE_VERIFY_DERIVATION."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_DATA"]
    #[doc = "                          The operation's capacity was less than"]
    #[doc = "                          the length of the expected value. In this case,"]
    #[doc = "                          the operation's capacity is set to 0, thus"]
    #[doc = "                          subsequent calls to this function will not"]
    #[doc = "                          succeed, even with a smaller expected output."]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The operation state is not valid (it must be active and completed"]
    #[doc = "         all required input steps)."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_verify_key(
        operation: *mut psa_key_derivation_operation_t,
        expected: psa_key_id_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " Abort a key derivation operation."]
    #[doc = ""]
    #[doc = " Aborting an operation frees all associated resources except for the \\c"]
    #[doc = " operation structure itself. Once aborted, the operation object can be reused"]
    #[doc = " for another operation by calling psa_key_derivation_setup() again."]
    #[doc = ""]
    #[doc = " This function may be called at any time after the operation"]
    #[doc = " object has been initialized as described in #psa_key_derivation_operation_t."]
    #[doc = ""]
    #[doc = " In particular, it is valid to call psa_key_derivation_abort() twice, or to"]
    #[doc = " call psa_key_derivation_abort() on an operation that has not been set up."]
    #[doc = ""]
    #[doc = " \\param[in,out] operation    The operation to abort."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_key_derivation_abort(operation: *mut psa_key_derivation_operation_t)
        -> psa_status_t;
}
extern "C" {
    #[doc = " Perform a key agreement and return the raw shared secret."]
    #[doc = ""]
    #[doc = " \\warning The raw result of a key agreement algorithm such as finite-field"]
    #[doc = " Diffie-Hellman or elliptic curve Diffie-Hellman has biases and should"]
    #[doc = " not be used directly as key material. It should instead be passed as"]
    #[doc = " input to a key derivation algorithm. To chain a key agreement with"]
    #[doc = " a key derivation, use psa_key_derivation_key_agreement() and other"]
    #[doc = " functions from the key derivation interface."]
    #[doc = ""]
    #[doc = " \\param alg                     The key agreement algorithm to compute"]
    #[doc = "                                (\\c PSA_ALG_XXX value such that"]
    #[doc = "                                #PSA_ALG_IS_RAW_KEY_AGREEMENT(\\p alg)"]
    #[doc = "                                is true)."]
    #[doc = " \\param private_key             Identifier of the private key to use. It must"]
    #[doc = "                                allow the usage #PSA_KEY_USAGE_DERIVE."]
    #[doc = " \\param[in] peer_key            Public key of the peer. It must be"]
    #[doc = "                                in the same format that psa_import_key()"]
    #[doc = "                                accepts. The standard formats for public"]
    #[doc = "                                keys are documented in the documentation"]
    #[doc = "                                of psa_export_public_key()."]
    #[doc = " \\param peer_key_length         Size of \\p peer_key in bytes."]
    #[doc = " \\param[out] output             Buffer where the decrypted message is to"]
    #[doc = "                                be written."]
    #[doc = " \\param output_size             Size of the \\c output buffer in bytes."]
    #[doc = " \\param[out] output_length      On success, the number of bytes"]
    #[doc = "                                that make up the returned output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p alg is not a key agreement algorithm"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p private_key is not compatible with \\p alg,"]
    #[doc = "         or \\p peer_key is not valid for \\p alg or not compatible with"]
    #[doc = "         \\p private_key."]
    #[doc = " \\retval #PSA_ERROR_BUFFER_TOO_SMALL"]
    #[doc = "         \\p output_size is too small"]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = "         \\p alg is not a supported key agreement algorithm."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_raw_key_agreement(
        alg: psa_algorithm_t,
        private_key: psa_key_id_t,
        peer_key: *const u8,
        peer_key_length: size_t,
        output: *mut u8,
        output_size: size_t,
        output_length: *mut size_t,
    ) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Generate random bytes."]
    #[doc = ""]
    #[doc = " \\warning This function **can** fail! Callers MUST check the return status"]
    #[doc = "          and MUST NOT use the content of the output buffer if the return"]
    #[doc = "          status is not #PSA_SUCCESS."]
    #[doc = ""]
    #[doc = " \\note    To generate a key, use psa_generate_key() instead."]
    #[doc = ""]
    #[doc = " \\param[out] output       Output buffer for the generated data."]
    #[doc = " \\param output_size       Number of bytes to generate and output."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_generate_random(output: *mut u8, output_size: size_t) -> psa_status_t;
}
extern "C" {
    #[doc = " \\brief Generate a key or key pair."]
    #[doc = ""]
    #[doc = " The key is generated randomly."]
    #[doc = " Its location, usage policy, type and size are taken from \\p attributes."]
    #[doc = ""]
    #[doc = " Implementations must reject an attempt to generate a key of size 0."]
    #[doc = ""]
    #[doc = " The following type-specific considerations apply:"]
    #[doc = " - For RSA keys (#PSA_KEY_TYPE_RSA_KEY_PAIR),"]
    #[doc = "   the public exponent is 65537."]
    #[doc = "   The modulus is a product of two probabilistic primes"]
    #[doc = "   between 2^{n-1} and 2^n where n is the bit size specified in the"]
    #[doc = "   attributes."]
    #[doc = ""]
    #[doc = " \\param[in] attributes    The attributes for the new key."]
    #[doc = " \\param[out] key          On success, an identifier for the newly created"]
    #[doc = "                          key. For persistent keys, this is the key"]
    #[doc = "                          identifier defined in \\p attributes."]
    #[doc = "                          \\c 0 on failure."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success."]
    #[doc = "         If the key is persistent, the key material and the key's metadata"]
    #[doc = "         have been saved to persistent storage."]
    #[doc = " \\retval #PSA_ERROR_ALREADY_EXISTS"]
    #[doc = "         This is an attempt to create a persistent key, and there is"]
    #[doc = "         already a persistent key with the given identifier."]
    #[doc = " \\retval #PSA_ERROR_NOT_SUPPORTED"]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_ENTROPY"]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_HARDWARE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_STORAGE"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_generate_key(
        attributes: *const psa_key_attributes_t,
        key: *mut psa_key_id_t,
    ) -> psa_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psa_client_key_attributes_s {
    pub type_: u16,
    pub bits: u16,
    pub lifetime: u32,
    pub id: psa_key_id_t,
    pub usage: u32,
    pub alg: u32,
    pub alg2: u32,
    pub flags: u16,
    pub domain_parameters: *mut ::std::os::raw::c_void,
    pub domain_parameters_size: u32,
}
#[test]
fn bindgen_test_layout_psa_client_key_attributes_s() {
    assert_eq!(
        ::std::mem::size_of::<psa_client_key_attributes_s>(),
        48usize,
        concat!("Size of: ", stringify!(psa_client_key_attributes_s))
    );
    assert_eq!(
        ::std::mem::align_of::<psa_client_key_attributes_s>(),
        8usize,
        concat!("Alignment of ", stringify!(psa_client_key_attributes_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).bits as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).lifetime as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(lifetime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_client_key_attributes_s>())).id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).usage as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_client_key_attributes_s>())).alg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(alg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).alg2 as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(alg2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).flags as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).domain_parameters as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(domain_parameters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<psa_client_key_attributes_s>())).domain_parameters_size
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_client_key_attributes_s),
            "::",
            stringify!(domain_parameters_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psa_hash_operation_s {
    pub handle: u32,
}
#[test]
fn bindgen_test_layout_psa_hash_operation_s() {
    assert_eq!(
        ::std::mem::size_of::<psa_hash_operation_s>(),
        4usize,
        concat!("Size of: ", stringify!(psa_hash_operation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<psa_hash_operation_s>(),
        4usize,
        concat!("Alignment of ", stringify!(psa_hash_operation_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_hash_operation_s>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_hash_operation_s),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psa_mac_operation_s {
    pub handle: u32,
}
#[test]
fn bindgen_test_layout_psa_mac_operation_s() {
    assert_eq!(
        ::std::mem::size_of::<psa_mac_operation_s>(),
        4usize,
        concat!("Size of: ", stringify!(psa_mac_operation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<psa_mac_operation_s>(),
        4usize,
        concat!("Alignment of ", stringify!(psa_mac_operation_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_mac_operation_s>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_mac_operation_s),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psa_cipher_operation_s {
    pub handle: u32,
}
#[test]
fn bindgen_test_layout_psa_cipher_operation_s() {
    assert_eq!(
        ::std::mem::size_of::<psa_cipher_operation_s>(),
        4usize,
        concat!("Size of: ", stringify!(psa_cipher_operation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<psa_cipher_operation_s>(),
        4usize,
        concat!("Alignment of ", stringify!(psa_cipher_operation_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_cipher_operation_s>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_cipher_operation_s),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psa_aead_operation_s {
    pub handle: u32,
}
#[test]
fn bindgen_test_layout_psa_aead_operation_s() {
    assert_eq!(
        ::std::mem::size_of::<psa_aead_operation_s>(),
        4usize,
        concat!("Size of: ", stringify!(psa_aead_operation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<psa_aead_operation_s>(),
        4usize,
        concat!("Alignment of ", stringify!(psa_aead_operation_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_aead_operation_s>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_aead_operation_s),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psa_key_derivation_s {
    pub handle: u32,
}
#[test]
fn bindgen_test_layout_psa_key_derivation_s() {
    assert_eq!(
        ::std::mem::size_of::<psa_key_derivation_s>(),
        4usize,
        concat!("Size of: ", stringify!(psa_key_derivation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<psa_key_derivation_s>(),
        4usize,
        concat!("Alignment of ", stringify!(psa_key_derivation_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psa_key_derivation_s>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psa_key_derivation_s),
            "::",
            stringify!(handle)
        )
    );
}
pub type psa_key_bits_t = u16;
pub type psa_key_handle_t = psa_key_id_t;
extern "C" {
    #[doc = " Open a handle to an existing persistent key."]
    #[doc = ""]
    #[doc = " Open a handle to a persistent key. A key is persistent if it was created"]
    #[doc = " with a lifetime other than #PSA_KEY_LIFETIME_VOLATILE. A persistent key"]
    #[doc = " always has a nonzero key identifier, set with psa_set_key_id() when"]
    #[doc = " creating the key. Implementations may provide additional pre-provisioned"]
    #[doc = " keys that can be opened with psa_open_key(). Such keys have an application"]
    #[doc = " key identifier in the vendor range, as documented in the description of"]
    #[doc = " #psa_key_id_t."]
    #[doc = ""]
    #[doc = " The application must eventually close the handle with psa_close_key() or"]
    #[doc = " psa_destroy_key() to release associated resources. If the application dies"]
    #[doc = " without calling one of these functions, the implementation should perform"]
    #[doc = " the equivalent of a call to psa_close_key()."]
    #[doc = ""]
    #[doc = " Some implementations permit an application to open the same key multiple"]
    #[doc = " times. If this is successful, each call to psa_open_key() will return a"]
    #[doc = " different key handle."]
    #[doc = ""]
    #[doc = " \\note This API is not part of the PSA Cryptography API Release 1.0.0"]
    #[doc = " specification. It was defined in the 1.0 Beta 3 version of the"]
    #[doc = " specification but was removed in the 1.0.0 released version. This API is"]
    #[doc = " kept for the time being to not break applications relying on it. It is not"]
    #[doc = " deprecated yet but will be in the near future."]
    #[doc = ""]
    #[doc = " \\note Applications that rely on opening a key multiple times will not be"]
    #[doc = " portable to implementations that only permit a single key handle to be"]
    #[doc = " opened. See also :ref:\\`key-handles\\`."]
    #[doc = ""]
    #[doc = ""]
    #[doc = " \\param id           The persistent identifier of the key."]
    #[doc = " \\param[out] key     On success, a handle to the key."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         Success. The application can now use the value of `*handle`"]
    #[doc = "         to access the key."]
    #[doc = " \\retval #PSA_ERROR_INSUFFICIENT_MEMORY"]
    #[doc = "         The implementation does not have sufficient resources to open the"]
    #[doc = "         key. This can be due to reaching an implementation limit on the"]
    #[doc = "         number of open keys, the number of open key handles, or available"]
    #[doc = "         memory."]
    #[doc = " \\retval #PSA_ERROR_DOES_NOT_EXIST"]
    #[doc = "         There is no persistent key with key identifier \\p id."]
    #[doc = " \\retval #PSA_ERROR_INVALID_ARGUMENT"]
    #[doc = "         \\p id is not a valid persistent key identifier."]
    #[doc = " \\retval #PSA_ERROR_NOT_PERMITTED"]
    #[doc = "         The specified key exists, but the application does not have the"]
    #[doc = "         permission to access it. Note that this specification does not"]
    #[doc = "         define any way to create such a key, but it may be possible"]
    #[doc = "         through implementation-specific means."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_STORAGE_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_DATA_INVALID"]
    #[doc = " \\retval #PSA_ERROR_DATA_CORRUPT"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_open_key(id: psa_key_id_t, key: *mut psa_key_id_t) -> psa_status_t;
}
extern "C" {
    #[doc = " Close a key handle."]
    #[doc = ""]
    #[doc = " If the handle designates a volatile key, this will destroy the key material"]
    #[doc = " and free all associated resources, just like psa_destroy_key()."]
    #[doc = ""]
    #[doc = " If this is the last open handle to a persistent key, then closing the handle"]
    #[doc = " will free all resources associated with the key in volatile memory. The key"]
    #[doc = " data in persistent storage is not affected and can be opened again later"]
    #[doc = " with a call to psa_open_key()."]
    #[doc = ""]
    #[doc = " Closing the key handle makes the handle invalid, and the key handle"]
    #[doc = " must not be used again by the application."]
    #[doc = ""]
    #[doc = " \\note This API is not part of the PSA Cryptography API Release 1.0.0"]
    #[doc = " specification. It was defined in the 1.0 Beta 3 version of the"]
    #[doc = " specification but was removed in the 1.0.0 released version. This API is"]
    #[doc = " kept for the time being to not break applications relying on it. It is not"]
    #[doc = " deprecated yet but will be in the near future."]
    #[doc = ""]
    #[doc = " \\note If the key handle was used to set up an active"]
    #[doc = " :ref:\\`multipart operation <multipart-operations>\\`, then closing the"]
    #[doc = " key handle can cause the multipart operation to fail. Applications should"]
    #[doc = " maintain the key handle until after the multipart operation has finished."]
    #[doc = ""]
    #[doc = " \\param key           The key to close."]
    #[doc = "                      If this is \\c 0, do nothing and return \\c PSA_SUCCESS."]
    #[doc = ""]
    #[doc = " \\retval #PSA_SUCCESS"]
    #[doc = "         \\p handle was a valid handle or \\c 0. It is now closed."]
    #[doc = " \\retval #PSA_ERROR_INVALID_HANDLE"]
    #[doc = "         \\p handle is not a valid handle nor \\c 0."]
    #[doc = " \\retval #PSA_ERROR_COMMUNICATION_FAILURE"]
    #[doc = " \\retval #PSA_ERROR_CORRUPTION_DETECTED"]
    #[doc = " \\retval #PSA_ERROR_BAD_STATE"]
    #[doc = "         The library has not been previously initialized by psa_crypto_init()."]
    #[doc = "         It is implementation-dependent whether a failure to initialize"]
    #[doc = "         results in this error code."]
    pub fn psa_close_key(key: psa_key_id_t) -> psa_status_t;
}
pub type clock_t = __clock_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> size_t;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cJSON {
    pub next: *mut cJSON,
    pub prev: *mut cJSON,
    pub child: *mut cJSON,
    pub type_: ::std::os::raw::c_int,
    pub valuestring: *mut ::std::os::raw::c_char,
    pub valueint: ::std::os::raw::c_int,
    pub valuedouble: f64,
    pub string: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_cJSON() {
    assert_eq!(
        ::std::mem::size_of::<cJSON>(),
        64usize,
        concat!("Size of: ", stringify!(cJSON))
    );
    assert_eq!(
        ::std::mem::align_of::<cJSON>(),
        8usize,
        concat!("Alignment of ", stringify!(cJSON))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).child as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).type_ as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).valuestring as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(valuestring)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).valueint as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(valueint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).valuedouble as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(valuedouble)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON>())).string as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON),
            "::",
            stringify!(string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cJSON_Hooks {
    pub malloc_fn:
        ::std::option::Option<unsafe extern "C" fn(sz: size_t) -> *mut ::std::os::raw::c_void>,
    pub free_fn: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout_cJSON_Hooks() {
    assert_eq!(
        ::std::mem::size_of::<cJSON_Hooks>(),
        16usize,
        concat!("Size of: ", stringify!(cJSON_Hooks))
    );
    assert_eq!(
        ::std::mem::align_of::<cJSON_Hooks>(),
        8usize,
        concat!("Alignment of ", stringify!(cJSON_Hooks))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON_Hooks>())).malloc_fn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON_Hooks),
            "::",
            stringify!(malloc_fn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cJSON_Hooks>())).free_fn as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cJSON_Hooks),
            "::",
            stringify!(free_fn)
        )
    );
}
pub type cJSON_bool = ::std::os::raw::c_int;
extern "C" {
    pub fn cJSON_Version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_InitHooks(hooks: *mut cJSON_Hooks);
}
extern "C" {
    pub fn cJSON_Parse(value: *const ::std::os::raw::c_char) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_ParseWithLength(
        value: *const ::std::os::raw::c_char,
        buffer_length: size_t,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_ParseWithOpts(
        value: *const ::std::os::raw::c_char,
        return_parse_end: *mut *const ::std::os::raw::c_char,
        require_null_terminated: cJSON_bool,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_ParseWithLengthOpts(
        value: *const ::std::os::raw::c_char,
        buffer_length: size_t,
        return_parse_end: *mut *const ::std::os::raw::c_char,
        require_null_terminated: cJSON_bool,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_Print(item: *const cJSON) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_PrintUnformatted(item: *const cJSON) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_PrintBuffered(
        item: *const cJSON,
        prebuffer: ::std::os::raw::c_int,
        fmt: cJSON_bool,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_PrintPreallocated(
        item: *mut cJSON,
        buffer: *mut ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        format: cJSON_bool,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_Delete(item: *mut cJSON);
}
extern "C" {
    pub fn cJSON_GetArraySize(array: *const cJSON) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cJSON_GetArrayItem(array: *const cJSON, index: ::std::os::raw::c_int) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_GetObjectItem(
        object: *const cJSON,
        string: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_GetObjectItemCaseSensitive(
        object: *const cJSON,
        string: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_HasObjectItem(
        object: *const cJSON,
        string: *const ::std::os::raw::c_char,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_GetErrorPtr() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_GetStringValue(item: *const cJSON) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_GetNumberValue(item: *const cJSON) -> f64;
}
extern "C" {
    pub fn cJSON_IsInvalid(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsFalse(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsTrue(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsBool(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsNull(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsNumber(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsString(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsArray(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsObject(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_IsRaw(item: *const cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_CreateNull() -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateTrue() -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateFalse() -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateBool(boolean: cJSON_bool) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateNumber(num: f64) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateString(string: *const ::std::os::raw::c_char) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateRaw(raw: *const ::std::os::raw::c_char) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateArray() -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateObject() -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateStringReference(string: *const ::std::os::raw::c_char) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateObjectReference(child: *const cJSON) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateArrayReference(child: *const cJSON) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateIntArray(
        numbers: *const ::std::os::raw::c_int,
        count: ::std::os::raw::c_int,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateFloatArray(numbers: *const f32, count: ::std::os::raw::c_int) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateDoubleArray(numbers: *const f64, count: ::std::os::raw::c_int)
        -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_CreateStringArray(
        strings: *const *const ::std::os::raw::c_char,
        count: ::std::os::raw::c_int,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddItemToArray(array: *mut cJSON, item: *mut cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_AddItemToObject(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
        item: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_AddItemToObjectCS(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
        item: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_AddItemReferenceToArray(array: *mut cJSON, item: *mut cJSON) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_AddItemReferenceToObject(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
        item: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_DetachItemViaPointer(parent: *mut cJSON, item: *mut cJSON) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_DetachItemFromArray(array: *mut cJSON, which: ::std::os::raw::c_int)
        -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_DeleteItemFromArray(array: *mut cJSON, which: ::std::os::raw::c_int);
}
extern "C" {
    pub fn cJSON_DetachItemFromObject(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_DetachItemFromObjectCaseSensitive(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_DeleteItemFromObject(object: *mut cJSON, string: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn cJSON_DeleteItemFromObjectCaseSensitive(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn cJSON_InsertItemInArray(
        array: *mut cJSON,
        which: ::std::os::raw::c_int,
        newitem: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_ReplaceItemViaPointer(
        parent: *mut cJSON,
        item: *mut cJSON,
        replacement: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_ReplaceItemInArray(
        array: *mut cJSON,
        which: ::std::os::raw::c_int,
        newitem: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_ReplaceItemInObject(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
        newitem: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_ReplaceItemInObjectCaseSensitive(
        object: *mut cJSON,
        string: *const ::std::os::raw::c_char,
        newitem: *mut cJSON,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_Duplicate(item: *const cJSON, recurse: cJSON_bool) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_Compare(
        a: *const cJSON,
        b: *const cJSON,
        case_sensitive: cJSON_bool,
    ) -> cJSON_bool;
}
extern "C" {
    pub fn cJSON_Minify(json: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn cJSON_AddNullToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddTrueToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddFalseToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddBoolToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
        boolean: cJSON_bool,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddNumberToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
        number: f64,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddStringToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
        string: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddRawToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
        raw: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddObjectToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_AddArrayToObject(
        object: *mut cJSON,
        name: *const ::std::os::raw::c_char,
    ) -> *mut cJSON;
}
extern "C" {
    pub fn cJSON_SetNumberHelper(object: *mut cJSON, number: f64) -> f64;
}
extern "C" {
    pub fn cJSON_SetValuestring(
        object: *mut cJSON,
        valuestring: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cJSON_malloc(size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn cJSON_free(object: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn base64_encode(
        indata: *const ::std::os::raw::c_char,
        inlen: size_t,
        outdata: *mut ::std::os::raw::c_char,
        outlen: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn base64_decode(
        indata: *const ::std::os::raw::c_char,
        inlen: size_t,
        outdata: *mut ::std::os::raw::c_char,
        outlen: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn base64url_encode(
        indata: *const ::std::os::raw::c_char,
        inlen: size_t,
        outdata: *mut ::std::os::raw::c_char,
        outlen: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn base64url_decode(
        indata: *const ::std::os::raw::c_char,
        inlen: size_t,
        outdata: *mut ::std::os::raw::c_char,
        outlen: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn base64url_malloc(len: *mut size_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn base64_encode_automatic(
        buf: *const ::std::os::raw::c_char,
        buf_len: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn base64_decode_automatic(
        inbuf: *const ::std::os::raw::c_char,
        inbuf_len: size_t,
        out_len: *mut size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn keccak256_getHash(msg: *const u8, len: size_t, hashResult: *mut u8);
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: size_t,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: size_t,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: size_t);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type pb_type_t = uint_least8_t;
pub type pb_size_t = uint_least16_t;
pub type pb_ssize_t = int_least16_t;
pub type pb_byte_t = uint_least8_t;
pub type pb_istream_t = pb_istream_s;
pub type pb_ostream_t = pb_ostream_s;
pub type pb_field_iter_t = pb_field_iter_s;
pub type pb_msgdesc_t = pb_msgdesc_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pb_msgdesc_s {
    pub field_info: *const u32,
    pub submsg_info: *const *const pb_msgdesc_t,
    pub default_value: *const pb_byte_t,
    pub field_callback: ::std::option::Option<
        unsafe extern "C" fn(
            istream: *mut pb_istream_t,
            ostream: *mut pb_ostream_t,
            field: *const pb_field_iter_t,
        ) -> bool,
    >,
    pub field_count: pb_size_t,
    pub required_field_count: pb_size_t,
    pub largest_tag: pb_size_t,
}
#[test]
fn bindgen_test_layout_pb_msgdesc_s() {
    assert_eq!(
        ::std::mem::size_of::<pb_msgdesc_s>(),
        40usize,
        concat!("Size of: ", stringify!(pb_msgdesc_s))
    );
    assert_eq!(
        ::std::mem::align_of::<pb_msgdesc_s>(),
        8usize,
        concat!("Alignment of ", stringify!(pb_msgdesc_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_msgdesc_s>())).field_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(field_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_msgdesc_s>())).submsg_info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(submsg_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_msgdesc_s>())).default_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(default_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_msgdesc_s>())).field_callback as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(field_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_msgdesc_s>())).field_count as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(field_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pb_msgdesc_s>())).required_field_count as *const _ as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(required_field_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_msgdesc_s>())).largest_tag as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_msgdesc_s),
            "::",
            stringify!(largest_tag)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pb_field_iter_s {
    pub descriptor: *const pb_msgdesc_t,
    pub message: *mut ::std::os::raw::c_void,
    pub index: pb_size_t,
    pub field_info_index: pb_size_t,
    pub required_field_index: pb_size_t,
    pub submessage_index: pb_size_t,
    pub tag: pb_size_t,
    pub data_size: pb_size_t,
    pub array_size: pb_size_t,
    pub type_: pb_type_t,
    pub pField: *mut ::std::os::raw::c_void,
    pub pData: *mut ::std::os::raw::c_void,
    pub pSize: *mut ::std::os::raw::c_void,
    pub submsg_desc: *const pb_msgdesc_t,
}
#[test]
fn bindgen_test_layout_pb_field_iter_s() {
    assert_eq!(
        ::std::mem::size_of::<pb_field_iter_s>(),
        64usize,
        concat!("Size of: ", stringify!(pb_field_iter_s))
    );
    assert_eq!(
        ::std::mem::align_of::<pb_field_iter_s>(),
        8usize,
        concat!("Alignment of ", stringify!(pb_field_iter_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).descriptor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(descriptor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).message as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).index as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pb_field_iter_s>())).field_info_index as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(field_info_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pb_field_iter_s>())).required_field_index as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(required_field_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pb_field_iter_s>())).submessage_index as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(submessage_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).tag as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).data_size as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).array_size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(array_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).type_ as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).pField as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(pField)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).pData as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).pSize as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(pSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_field_iter_s>())).submsg_desc as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_field_iter_s),
            "::",
            stringify!(submsg_desc)
        )
    );
}
pub type pb_field_t = pb_field_iter_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pb_bytes_array_s {
    pub size: pb_size_t,
    pub bytes: [pb_byte_t; 1usize],
}
#[test]
fn bindgen_test_layout_pb_bytes_array_s() {
    assert_eq!(
        ::std::mem::size_of::<pb_bytes_array_s>(),
        4usize,
        concat!("Size of: ", stringify!(pb_bytes_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<pb_bytes_array_s>(),
        2usize,
        concat!("Alignment of ", stringify!(pb_bytes_array_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_bytes_array_s>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_bytes_array_s),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pb_bytes_array_s>())).bytes as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pb_bytes_array_s),
            "::",
            stringify!(bytes)
        )
    );
}
pub type pb_bytes_array_t = pb_bytes_array_s;
pub type pb_callback_t = pb_callback_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pb_callback_s {
    pub funcs: pb_callback_s__bindgen_ty_1,
    pub arg: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pb_callback_s__bindgen_ty_1 {
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            stream: *mut pb_istream_t,
            field: *const pb_field_t,
            arg: *mut *mut ::std::os::raw::c_void,
        ) -> bool,
    >,
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(
            stream: *mut pb_ostream_t,
